[
  {
    "Name": "CanExport SMEs",
    "Amount": 50000,
    "Deadline": "2024-05-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Gathering market intelligence (custom research, reports and studies), Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences, Visits to foreign markets, In-person participation at trade shows, networking functions, meetings or conferences, Participating in a trade mission",
    "Eligible_Applicants": "For-profit businesses, incorporated legal entities, limited liability partnerships (LLP) or cooperatives with active Canada Revenue Agency business number, fewer than 500 full-time equivalent employees, and $100,000 to $100 million in declared revenue in Canada during its past fiscal year",
    "Eligible_Criteria": "Please review the Applicant's Guide before submitting the application",
    "Description": "The CanExport SMEs program provides a non-repayable contribution of up to $50,000 to help Canadian small and medium-sized enterprises break into international markets where they have little to no sales. The program covers up to 50% of eligible costs and supports various non-travel activities as well as in-person participation in trade shows, and trade missions based on Government of Canada Travel Advisories.",
    "Summary": "The CanExport SMEs program offers funding to Canadian SMEs to grow into global markets by supporting non-travel activities and in-person participation in trade shows and trade missions.",
    "Grant_Goals": "To help Canadian small and medium-sized enterprises break into international markets where they have little to no sales",
    "Eligible_Industries": "all",
    "Link": "https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  }
]