[
  {
    "Name": "Innovative Solutions Canada",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Early-stage development, testing and validation of a prototype, pathway to commercialization",
    "Eligible_Applicants": "Incorporated Canadian for-profit businesses with fewer than 499 full-time employees and do research and development activities in Canada",
    "Eligible_Criteria": "Read the challenge requirements. Begin the online application process. If your proposal is selected, the sponsor will reach out to you with more information on the next steps. Begin the project and report as needed.",
    "Description": "The government of Canada is looking for innovators to solve challenges and provide funding for the development, testing, and validation of prototypes.",
    "Summary": "The Innovative Solutions Canada program supports Canadian innovators and entrepreneurs in developing novel solutions to government challenges.",
    "Grant_Goals": "To support the growth of Canadian innovators and entrepreneurs by providing funding and facilitation of early development, testing and validation of prototypes.",
    "Eligible_Industries": "all",
    "Link": "https://ised-isde.canada.ca/site/innovative-solutions-canada/en/challenges"
  },
  {
    "Name": "Grand Challenges Canada",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Coming Soon",
    "Eligible_Applicants": "Coming Soon",
    "Eligible_Criteria": "Coming Soon",
    "Description": "Grand Challenges Canada seeks bold ideas from the best and brightest innovators to save and improve lives in low- and middle-income countries and Canada.",
    "Summary": "Grand Challenges Canada invests in ideas that apply science and technology, as well as integrate social and business approaches, to generate transformative impact.",
    "Grant_Goals": "To save and improve lives in low- and middle-income countries and Canada",
    "Eligible_Industries": "healthcare,global health innovation,humanitarian",
    "Link": "https://www.grandchallenges.ca/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "SDTC Funding",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "",
    "Eligible_Applicants": "A Canadian company with a defined project, A strong end-user value proposition, The potential to attract a consortia partner to validate the market need and; Demonstrated environmental and economic benefits for Canadians",
    "Eligible_Criteria": "Coming Soon",
    "Description": "Your great new idea for a business expansion or a new product line could be eligible for SDTC funding if you have: A Canadian company with a defined project, A strong end-user value proposition, The potential to attract a consortia partner to validate the market need and; Demonstrated environmental and economic benefits for Canadians",
    "Summary": "On average 33% (up to 40%) of eligible projects costs. The average contribution is between $2 million and $4 million, with funds disbursed in five years or less.",
    "Grant_Goals": "Coming Soon",
    "Eligible_Industries": "all",
    "Link": "https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Regional Economic Growth through Innovation",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Atlantic Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "scale up and expand, make the most of new technologies, improve productivity, create new products and find new markets",
    "Eligible_Applicants": "sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations",
    "Eligible_Criteria": "Contact your nearest ACOA office to discuss your project and then complete and submit the Application for financial assistance.",
    "Description": "The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada by helping businesses and non-profit organizations develop a strong, dynamic, and inclusive economy.",
    "Summary": "The Regional Economic Growth through Innovation (REGI) program aims to help businesses speed up their growth, be more productive, compete on the world stage, reach new markets and create strong and inclusive regional networks to fuel growth and innovation.",
    "Grant_Goals": "To create strong and inclusive regional networks to fuel growth and innovation",
    "Eligible_Industries": "all",
    "Link": "https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Voucher Program",
    "Amount": 100000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "New product research and development, leading-edge design, engineering and prototype development, advanced product testing and refinement, patent development, advanced market assessments, other technology development activities",
    "Eligible_Applicants": "For profit organization incorporated or partnership registered in Alberta, fewer than 500 full-time employees, less than $50,000,000 in annual gross revenue, and new, unique technology or innovation working toward commercialization",
    "Eligible_Criteria": "Connect with Alberta Innovates, review Program Guide for complete list of eligibility requirements",
    "Description": "The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit. It can cover the costs of up to three contracted service providers for business and technology development.",
    "Summary": "The Voucher Program provides Alberta tech companies with up to $100,000 to accelerate new product commercialization.",
    "Grant_Goals": "To accelerate new product commercialization for tech and innovation companies",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Micro Voucher Program",
    "Amount": 10000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Design, engineering, and prototype development; product testing and refinement; patent development; advanced market assessment or segmentation analysis; certifications; advanced business and/or marketing strategies; other technology development activities considered on a case-by-case basis.",
    "Eligible_Applicants": "Small to Medium Enterprise with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.",
    "Eligible_Criteria": "All applications are reviewed and evaluated to determine fit with the Micro Voucher Program objectives and intended outcomes.",
    "Description": "The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.",
    "Summary": "The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.",
    "Grant_Goals": "To help Alberta tech companies design and/or develop innovative technological solutions",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Product Demonstration Program",
    "Amount": 150000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Build a relationship with a strategic partner, Validate your product to a potential customer or market, Have your first sale or increase sales revenue within 18 months post project, Expand your supply or distribution channels, Increase your global competitiveness, Provide your strategic partner with access to innovative products to solve operational challenges for itself or its customers, Help your strategic partner to de-risk exposure to new technology, Expand products in strategic partners’ distribution channels.",
    "Eligible_Applicants": "Alberta tech companies with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.",
    "Eligible_Criteria": "Full program and application details can be found in the Program Guide.",
    "Description": "The Product Demonstration Program provides support for Alberta tech companies to commercialize their products and achieve optimal market position, aiming to increase revenue and expand into global markets.",
    "Summary": "The Product Demonstration Program offers up to $150,000 for Alberta tech companies to enter a partnership with a strategic partner to conduct a product pilot or demonstration, validating their product’s technical and business merits.",
    "Grant_Goals": "To support Alberta tech companies in commercializing their products and achieving optimal market position to increase revenue and expand into global markets.",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Commercialization Consulting & Mentoring",
    "Amount": 16250,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Hire consultants or mentors to help get a new and innovative product, technology, or process to market. Host group learning activities that will improve knowledge and preparedness for commercialization.",
    "Eligible_Applicants": "Small or medium sized business, University or Community College, Research institution (excluding Federal labs)",
    "Eligible_Criteria": "Eligible applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible. Once the application is approved, costs incurred as of the date that the application was received by LearnSphere will be deemed admissible.",
    "Description": "The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.",
    "Summary": "The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.",
    "Grant_Goals": "To increase the number of research positions in Southern Ontario",
    "Eligible_Industries": "all",
    "Link": "https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "REGI Program Funding",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Acquisition of digital production equipment or machinery and infrastructure, assessment, adaptation or adoption of new technologies or new production processes, activities aimed at boosting productivity and production or innovation capacity, commercialization and market development, implementation of commercialization strategies, participation in trade fairs, prospecting visits, hiring of marketing staff, ad campaigns, market diagnostics and studies, technology showcasing and demonstration, business management, hiring of resources to set up top-performing teams, adoption of best management practices, processes and systems, more activities may be eligible - contact us for details.",
    "Eligible_Applicants": "SMEs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, Indigenous organizations",
    "Eligible_Criteria": "Projects are analyzed against specific criteria including expected results, viability of business or organization, technical and financial management capacity, contribution of partners, and degree of risk. Refer to the Project Submission Guide for more details.",
    "Description": "This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity, and growth through innovation. This funding is provided under the REGI program.",
    "Summary": "Offers financial assistance for projects aimed at fostering expansion, productivity, and growth through innovation, targeting SMEs, NPOs, and various organizations in eligible sectors.",
    "Grant_Goals": "To foster innovation and business growth in eligible sectors.",
    "Eligible_Industries": "manufacturing,food processing,information, communications and multimedia technologies,life sciences",
    "Link": "https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Alberta Export Expansion Program",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "International travel to formal outbound trade events",
    "Eligible_Applicants": "Alberta companies and non-profits",
    "Eligible_Criteria": "Coming Soon",
    "Description": "Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.",
    "Summary": "Supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations that promote Alberta exports through international travel to formal outbound trade events.",
    "Grant_Goals": "Enhancing international trade",
    "Eligible_Industries": "all",
    "Link": "https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Ignite",
    "Amount": 300000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "British Columbia",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Research and development of new innovative technology in natural resources, engineering, or applied sciences",
    "Eligible_Applicants": "Teams of academia and industry working on projects in natural resources and applied sciences",
    "Eligible_Criteria": "The project must support the research and development of a new, innovative technology solving an industry problem in natural resources, engineering, or applied sciences.",
    "Description": "The Ignite program supports the research and development of new, innovative technologies that solve industry problems in natural resources, engineering, or applied sciences, with the aim of achieving commercialization within 3 years of the project start date.",
    "Summary": "The Ignite program provides funding of up to $300,000 for teams of academia and industry working on projects in natural resources and applied sciences to support the research and development of new innovative technology.",
    "Grant_Goals": "To support the commercialization of research and development projects in natural resources, engineering, or applied sciences",
    "Eligible_Industries": "natural resources,engineering,all",
    "Link": "https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Coming Soon",
    "Amount": 0,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Coming Soon",
    "Eligible_Applicants": "Coming Soon",
    "Eligible_Criteria": "Coming Soon",
    "Description": "Coming Soon",
    "Summary": "Coming Soon",
    "Grant_Goals": "Coming Soon",
    "Eligible_Industries": "all",
    "Link": "https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Canada-Alberta Job Grant",
    "Amount": 15000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training and development for current or potential employees",
    "Eligible_Applicants": "Private sector employers, non-profit sector employers, First Nations, Metis Settlements, and certain financial institutions",
    "Eligible_Criteria": "Apply through the Canada-Alberta Job Grant portal. Employers must contribute a minimum of one-third of the total training costs for existing employees.",
    "Description": "The Canada-Alberta Job Grant is a training program where eligible employers can receive government funding to help employees access training opportunities.",
    "Summary": "The Canada-Alberta Job Grant provides funding to support employers in providing training to employees for current or future positions.",
    "Grant_Goals": "To provide employers with financial assistance to train and develop their workforce",
    "Eligible_Industries": "all",
    "Link": "https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Starter Company Plus",
    "Amount": 5000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Ontario",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Participate in business workshops, seminars, or networking events",
    "Eligible_Applicants": "18 years of age or older, Ontario resident and Canadian citizen or permanent resident, not attending school full-time or returning to school",
    "Eligible_Criteria": "Apply through a Small Business Enterprise Centre",
    "Description": "Apply for training, mentoring, and a grant through the Starter Company Plus program to start, expand, or buy a small business in Ontario.",
    "Summary": "The Starter Company Plus program provides one-on-one guidance, business workshops, mentoring, and a grant of up to $5,000 to help start, expand, or buy a small business in Ontario.",
    "Grant_Goals": "Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians, with an additional mandate for small business.",
    "Eligible_Industries": "all",
    "Link": "https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Aboriginal Business Financing Program (ABFP)",
    "Amount": 99999,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched (accountant or other), development of a business plan, marketing plan or feasibilities studies",
    "Eligible_Applicants": "FIRST NATIONS, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC",
    "Eligible_Criteria": "To be a First Nation or the Native Alliance of Quebec, have the necessary financial resources (equity: 10% minimum of the cost of the project), present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, operate a business not involved in gambling, sex, alcohol, tobacco",
    "Description": "The Aboriginal Business Financing Program (ABFP) provides a non-refundable contribution for the start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, and development of business plans or feasibilities studies to eligible First Nations and members of the Native Alliance of Quebec.",
    "Summary": "ABFP provides non-refundable contributions of up to $99,999 to eligible First Nations and members of the Native Alliance of Quebec for the development of viable business projects and activities.",
    "Grant_Goals": "To support the economic development and growth of eligible First Nations communities and businesses.",
    "Eligible_Industries": "all",
    "Link": "https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Grant for Nunavut Employers",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Nunavut",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training or professional development for Nunavummiut",
    "Eligible_Applicants": "Registered Nunavut-based employers",
    "Eligible_Criteria": "Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information",
    "Description": "The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.",
    "Summary": "The Grant for Nunavut Employers covers two-thirds of the eligible costs for each trainee and is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.",
    "Grant_Goals": "Encourages employers to provide training or professional development to benefit Nunavummiut",
    "Eligible_Industries": "all",
    "Link": "https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Rapid Business Readiness Training",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Management and marketing skills development",
    "Eligible_Applicants": "First Nations entrepreneurs",
    "Eligible_Criteria": "Submit application with purpose of the course, course outline, and detailed budget",
    "Description": "The program supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills.",
    "Summary": "Supports rapid business readiness training for First Nations entrepreneurs.",
    "Grant_Goals": "To develop management and marketing skills of First Nations entrepreneurs",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Manitoba First Nation Business Support Program",
    "Amount": 20000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Professional business plan development",
    "Eligible_Applicants": "Manitoba First Nation individuals or First Nation-based enterprises",
    "Eligible_Criteria": "Submit an application describing the business, not have owned a similar business in the past 12 months, provide the name and qualifications of the proposed consultant, proposed terms of reference, and a written proposal, including a quote.",
    "Description": "This program provides support to Manitoba First Nation individuals or First Nation-based enterprises with a business concept that demonstrates a need for financial assistance, by allowing the applicant to engage the services of a professional consultant to develop a quality business plan.",
    "Summary": "The Manitoba First Nation Business Support Program offers non-repayable funding of up to $20,000 to assist in the research and development of quality business plans for eligible individuals or enterprises.",
    "Grant_Goals": "To provide support to Manitoba First Nation individuals or First Nation-based enterprises in developing quality business plans to attract financing.",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Non-Repayable Business Contribution Fund",
    "Amount": 250000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Start-up, expansion, acquisition of viable business, development of independent business plan, environmental assessments, marketing, business support",
    "Eligible_Applicants": "First Nation individual, Manitoba First Nation or group of Manitoba First Nations",
    "Eligible_Criteria": "Must provide historical financial statements, business valuation, have minimum cash equity, show viability and management capacity",
    "Description": "The Business Contribution Fund provides non-repayable contributions towards start-up, expansion, or acquisition of viable businesses for eligible First Nation individuals and groups in Manitoba.",
    "Summary": "The Non-Repayable Business Contribution Fund supports eligible First Nation individuals and Manitoba First Nations with non-repayable contributions towards business start-up, expansion, and acquisition.",
    "Grant_Goals": "To support economic growth and development of eligible First Nation businesses in Manitoba",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_contribution_fund.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "BUSINESS CONTRIBUTION FUND",
    "Amount": 250000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Start-up, expansion, acquisition of a viable business, development of an independent business plan, environmental assessments, marketing costs, business support",
    "Eligible_Applicants": "First Nation individuals, Manitoba First Nation Communities, groups of Manitoba First Nations",
    "Eligible_Criteria": "Requirements for minimum cash equity, commercial loan, ownership, business plan, restrictions on certain businesses, and control period for non-repayable contribution",
    "Description": "The Business Contribution Fund (BCF) is a non-repayable funding opportunity available for eligible First Nation Businesses in Manitoba. It offers a maximum contribution of up to $250,000 for a business owned by a Manitoba First Nation or group of Manitoba First Nations. The funding supports start-up, expansion, or acquisition of viable businesses, as well as the development of independent business plans, environmental assessments, marketing costs, and business support.",
    "Summary": "The BCF provides non-repayable contributions of up to 30% to 40% of eligible costs, with a maximum of $250,000 for businesses owned by Manitoba First Nations. It aims to support the economic growth and viability of First Nation businesses in Manitoba.",
    "Grant_Goals": "To support the economic growth and viability of First Nation businesses in Manitoba",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_contribution_fund.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Sustainable Development Technology Canada (SDTC)",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Check SDTC website for eligible activities",
    "Eligible_Applicants": "Canadian companies with defined projects, strong end-user value proposition, potential to attract a consortia partner, and demonstrated environmental and economic benefits for Canadians",
    "Eligible_Criteria": "Check SDTC website for eligible criteria",
    "Description": "SDTC acts as a catalyst, establishing a growing pipeline of emerging companies that will become the next market leaders in sustainability.",
    "Summary": "Sustainable Development Technology Canada (SDTC) provides funding for Canadian companies with defined projects, strong end-user value proposition, potential to attract a consortia partner, and demonstrated environmental and economic benefits for Canadians.",
    "Grant_Goals": "To establish a pipeline of emerging companies that will become the next market leaders in sustainability.",
    "Eligible_Industries": "all",
    "Link": "https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Regional Economic Growth through Innovation (REGI)",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "scale up and expand, make the most of new technologies, improve productivity, create new products, find new markets, support businesses at each stage of development, create strong and inclusive regional networks to fuel growth and innovation",
    "Eligible_Applicants": "sole proprietorships, partnerships, social enterprises, incorporated companies, corporations, co-operatives, Indigenous-owned businesses, non-profit organizations, post-secondary educational institutions, accelerators, business incubators, angel networks, industry associations, consortiums, municipalities, community-owned Indigenous businesses",
    "Eligible_Criteria": "Contact your nearest ACOA office to discuss your project and then complete and submit the Application for financial assistance.",
    "Description": "The REGI program creates the right conditions to start and grow businesses in Atlantic Canada. It helps businesses and non-profit organizations develop a strong, dynamic, and inclusive economy by providing funding for business scale-up and productivity, as well as for regional innovation ecosystems.",
    "Summary": "The REGI program offers funding options for business scale-up and productivity as well as for regional innovation ecosystems, aiming to fuel growth and innovation in Atlantic Canada.",
    "Grant_Goals": "To create strong and inclusive regional networks to fuel growth and innovation in Atlantic Canada",
    "Eligible_Industries": "all",
    "Link": "https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Voucher Program",
    "Amount": 100000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "New product research and development, leading-edge design, engineering and prototype development, advanced product testing and refinement, patent development, advanced market assessments",
    "Eligible_Applicants": "For profit organization incorporated or a partnership registered in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue",
    "Eligible_Criteria": "For more information, consult the Program Guide.",
    "Description": "The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit.",
    "Summary": "The Voucher Program provides Alberta tech companies with up to $100,000 to accelerate new product commercialization.",
    "Grant_Goals": "To accelerate new product commercialization for Alberta tech and innovation companies",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Micro Voucher Program",
    "Amount": 10000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Design, engineering, and prototype development. Product testing and refinement. Patent development; (excluding patent maintenance fees). Advanced market assessment or segmentation analysis. Certifications. Advanced business and/or marketing strategies. Other technology development activities that will be considered on a case-by-case basis.",
    "Eligible_Applicants": "Small to Medium Enterprise with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue, with a novel technology and the ability to scale up in one to two years, and other specific criteria outlined in the Program Guide.",
    "Eligible_Criteria": "Application details to be submitted through the SmartSimple online portal or by contacting Alberta Innovates. The evaluation process involves a review to determine fit with the program objectives and intended outcomes.",
    "Description": "The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions. Qualified activities include various technology development processes such as design, engineering, and prototype development, as well as advanced market assessment and certification.",
    "Summary": "The Micro Voucher Program offers non-dilutive funding of up to $10,000 to support Alberta tech companies in developing innovative technology solutions, emphasizing activities like design, engineering, and prototype development.",
    "Grant_Goals": "To assist Alberta tech companies in designing and developing innovative technology solutions.",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Product Demonstration Program",
    "Amount": 150000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Build a relationship with a strategic partner, Validate your product to a potential customer or market, Have your first sale or increase sales revenue within 18 months post project, Expand your supply or distribution channels, Increase your global competitiveness, Provide your strategic partner with access to innovative products to solve operational challenges for itself or its customers, Help your strategic partner to de-risk exposure to new technology, Expand products in strategic partners’ distribution channels",
    "Eligible_Applicants": "Less than 500 full-time employees and less than $50,000,000 in annual gross revenue, ready to pilot a product in an operational setting, looking to expand sales or broaden market segments, identified a potential strategic partner, can complete the pilot or demonstration within one year, can reasonably expect a first sale or distribution agreement within 18 months if the pilot is successful, can reasonably expect expanded sales or distribution agreements if the demonstration is successful within 18 months",
    "Eligible_Criteria": "Full program and application details can be found in the Program Guide",
    "Description": "The Product Demonstration Program supports Alberta tech companies commercialize their products and achieve optimal market position to increase revenue and expand into global markets.",
    "Summary": "The Product Demonstration Program provides up to $150,000 to Alberta tech companies who want to commercialize their products and achieve optimal market position.",
    "Grant_Goals": "increase revenue and expand into global markets",
    "Eligible_Industries": "",
    "Link": "https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Commercialization Consulting and Mentoring Program",
    "Amount": 16250,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Hire consultants or mentors, host group learning activities",
    "Eligible_Applicants": "Small or medium sized businesses, Universities, Community Colleges, Research institutions",
    "Eligible_Criteria": "Eligible activities must support the commercialization of a new and innovative product, technology, or process; and/or help develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission.",
    "Description": "The Commercialization Consulting and Mentoring Program provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.",
    "Summary": "The CCM Program provides up to $16,250 (65% of project costs) to hire consultants or mentors and host group learning activities, managed by LearnSphere with financial assistance from the Atlantic Canada Opportunities Agency.",
    "Grant_Goals": "To help Atlantic Canadian businesses and institutions in the final stages of commercialization",
    "Eligible_Industries": "all",
    "Link": "https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Business Scale-Up and Productivity Funding",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Acquisition of digital production equipment or machinery and infrastructure, Assessment, adaptation or adoption of new technologies or new production processes, Activities aimed at boosting productivity and production or innovation capacity, Commercialization and market development, Implementation of commercialization strategies, Participation in trade fairs, Prospecting visits, Hiring of marketing staff, Ad campaigns, Market diagnostics and studies, Technology showcasing and demonstration, Business management, Hiring of resources to set up top-performing teams, Adoption of best management practices, processes and systems, Other activities may also be eligible. Contact us to discuss your project.",
    "Eligible_Applicants": "SMEs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, Indigenous organizations",
    "Eligible_Criteria": "Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk",
    "Description": "This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program.",
    "Summary": "This funding aims to foster innovation and business growth, and can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity, and growth through innovation.",
    "Grant_Goals": "To foster innovation and business growth",
    "Eligible_Industries": "Manufacturing,Food processing,Information, communications and multimedia technologies,Life sciences",
    "Link": "https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Alberta Export Expansion Program",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Formal outbound trade events, international travel",
    "Eligible_Applicants": "Alberta's small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations",
    "Eligible_Criteria": "Coming Soon",
    "Description": "Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.",
    "Summary": "The Alberta Export Expansion Program (AEEP) supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations that promote Alberta exports through international travel to formal outbound trade events.",
    "Grant_Goals": "Enhancing international trade for Alberta's economic success",
    "Eligible_Industries": "all",
    "Link": "https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Ignite",
    "Amount": 300000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "British Columbia",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "The project supports the research and development of a new, innovative technology that solves an industry problem in the natural resources, engineering or applied sciences. The innovation must have a strong research and commercialization plan, with the aim of achieving commercialization within 3 years of the project start date.",
    "Eligible_Applicants": "Teams of academia and industry working on projects in the areas of natural resources and applied sciences",
    "Eligible_Criteria": "The project is a collaboration between a B.C. based industry and academic partner, with majority of the project work occurring in B.C. The project partners must be in agreement regarding IP ownership. The innovation is at a minimum of Technology Readiness Level (TRL) of 3. The project must secure matching funds from industry or government sources at a ratio of 2:1 matching dollars.",
    "Description": "Need help to commercialize your research? Teams of academia and industry working on projects in the areas of natural resources and applied sciences can receive up to $300,000 for research and development.",
    "Summary": "The Ignite program provides funding of up to $300,000 to support the research and development of new, innovative technologies in the natural resources, engineering, and applied sciences sectors in British Columbia.",
    "Grant_Goals": "To support the research and development of innovative technologies that solve industry problems in natural resources, engineering, and applied sciences.",
    "Eligible_Industries": "technology,all",
    "Link": "https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Coming Soon",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Coming Soon",
    "Eligible_Applicants": "Coming Soon",
    "Eligible_Criteria": "Coming Soon",
    "Description": "Coming Soon",
    "Summary": "Coming Soon",
    "Grant_Goals": "Coming Soon",
    "Eligible_Industries": "all",
    "Link": "https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Canada-Alberta Job Grant",
    "Amount": 15000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training for present or future employees, eligible travel costs, tuition fees, instructional fees, mandatory student fees, examination fees, textbooks, software",
    "Eligible_Applicants": "Private sector employers, non-profit sector employers, First Nations and Metis Settlements, Agriculture Financial Services Corporation, Alberta Treasury Branches",
    "Eligible_Criteria": "Complete the correct application for trainees, declaration on Employment Insurance status, submit Training Completion form to receive funding",
    "Description": "The Canada-Alberta Job Grant is a training program where an employer applies on behalf of their present or future employees for eligible training costs.",
    "Summary": "The Canada-Alberta Job Grant provides government funding to help employees and unemployed Albertans access training opportunities.",
    "Grant_Goals": "To provide a training program for employers to help their present or future employees access eligible training costs.",
    "Eligible_Industries": "all",
    "Link": "https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Starter Company Plus",
    "Amount": 5000,
    "Deadline": "2024-02-07",
    "Eligible_Region": "Ontario",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "business workshops, seminars, networking events",
    "Eligible_Applicants": "Ontario resident and Canadian citizen (or permanent resident) not attending school full-time or returning to school and able to make a contribution in cash or in kind at least 25% of the grant amount",
    "Eligible_Criteria": "Apply through a Small Business Enterprise Centre",
    "Description": "Starter Company Plus program provides training, mentoring, and a grant of up to $5,000 for starting, expanding, or buying a small business in Ontario.",
    "Summary": "The Starter Company Plus program offers one-on-one guidance, business workshops, mentorship, and a grant of up to $5,000 to support starting, expanding, or buying a small business in Ontario.",
    "Grant_Goals": "Supporting a strong, innovative economy and providing jobs and prosperity for all Ontarians, with an additional mandate for small business.",
    "Eligible_Industries": "all",
    "Link": "https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Aboriginal Business Financing Program (ABFP)",
    "Amount": 99999,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, development of a business plan, marketing plan or feasibilities studies",
    "Eligible_Applicants": "FIRST NATIONS, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC",
    "Eligible_Criteria": "Be a First Nation or the Native Alliance of Quebec, have the necessary financial resources, present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, operate a business not involved in certain sectors of activity",
    "Description": "The Aboriginal Business Financing Program (ABFP) provides non-refundable contributions for the start-up, acquisition, or expansion of businesses, as well as for the implementation of marketing activities and project-related management. It requires the applicant to be a member of specific First Nations groups and have the necessary financial resources to present a viable business project.",
    "Summary": "The Aboriginal Business Financing Program (ABFP) offers non-refundable contributions of up to $99,999 for eligible First Nations groups and members to support the development and growth of viable business projects.",
    "Grant_Goals": "To support the development and growth of viable business projects within eligible First Nations groups and members.",
    "Eligible_Industries": "all",
    "Link": "https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Grant for Nunavut Employers",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Nunavut",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training or professional development for Nunavummiut to lead to new positions, promotions, increased pay, or regular employment",
    "Eligible_Applicants": "Registered Nunavut-based employers with available positions for trainees to advance into after training, and can contribute at least one-third of the total eligible training expenses",
    "Eligible_Criteria": "Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information",
    "Description": "The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.",
    "Summary": "The Grant for Nunavut Employers covers two-thirds of eligible training costs for each trainee and provides funding subject to availability in the form of reimbursement to the employer based on the successful completion of training.",
    "Grant_Goals": "Encourages employers to provide training or professional development to Nunavummiut, leading to new positions, promotions, increased pay, or regular employment",
    "Eligible_Industries": "all",
    "Link": "https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Rapid Business Readiness Training for First Nations Entrepreneurs",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training for business management and marketing skills development",
    "Eligible_Applicants": "First Nations entrepreneurs",
    "Eligible_Criteria": "Submission of course purpose, outline, and budget; approach other First Nation educational funding agencies; training through approved organizations specific to business management; on-the-job training for First Nation-owned businesses",
    "Description": "The program supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills.",
    "Summary": "Supports rapid business readiness training for First Nations entrepreneurs to develop management and marketing skills.",
    "Grant_Goals": "To enhance the management and marketing skills of First Nations entrepreneurs",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Manitoba First Nation Business Plan Support",
    "Amount": 20000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Engaging a professional consultant for business plan development, submitting a business concept summary",
    "Eligible_Applicants": "Members of a Manitoba First Nation, aged 18 and over, eligible to work in Canada, not have owned a similar business in the past 12 months",
    "Eligible_Criteria": "Submission of a written proposal, obtaining competitive quotes, approval of funding required prior to consultant commencing the assignment",
    "Description": "This program aims to support Manitoba First Nation individuals or First Nation-based enterprises with the development of a business plan and provides non-repayable funding of up to 75% of the costs to a maximum of $20,000.",
    "Summary": "The program provides financial assistance to Manitoba First Nation individuals or enterprises for engaging professional consultants to develop quality business plans.",
    "Grant_Goals": "To provide financial assistance and support for Manitoba First Nation individuals or enterprises to develop quality business plans",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "NON-REPAYABLE BUSINESS CONTRIBUTION FUND",
    "Amount": 250000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Contributions towards start-up, expansion, or acquisition of a viable business; development of an independent business plan; environmental assessments; marketing costs; business support (training, aftercare management)",
    "Eligible_Applicants": "First Nation individual, Manitoba First Nation Community, group of Manitoba First Nations",
    "Eligible_Criteria": "Follow guidelines provided by First Peoples Economic Growth Fund (FPEGF)",
    "Description": "The Business Contribution Fund provides non-repayable contributions towards capital and operating costs, development of business plans, marketing costs, and business support. Certain restrictions and control periods apply.",
    "Summary": "Non-repayable contributions for First Nation businesses in Manitoba towards capital, operating costs, and business development.",
    "Grant_Goals": "To support the economic growth of eligible First Nation businesses in Manitoba",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_contribution_fund.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Business scale-up and productivity",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Acquisition of digital production equipment or machinery and infrastructure, Assessment, adaptation or adoption of new technologies or new production processes, Activities aimed at boosting productivity and production or innovation capacity, Commercialization and market development, Implementation of commercialization strategies, Participation in trade fairs, Prospecting visits, Hiring of marketing staff, Ad campaigns, Market diagnostics and studies, Technology showcasing and demonstration, Business management, Hiring of resources to set up top-performing teams, Adoption of best management practices, processes and systems (e.g., Enterprise Resource Planning)",
    "Eligible_Applicants": "SMEs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, Indigenous organizations",
    "Eligible_Criteria": "Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk",
    "Description": "This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program.",
    "Summary": "Funding to foster innovation and business growth for SMEs or NPOs at any stage of development under the REGI program.",
    "Grant_Goals": "To foster innovation and business growth",
    "Eligible_Industries": "manufacturing,food processing,information, communications and multimedia technologies,life sciences",
    "Link": "https://ced.canada.ca/eng/programs/regi/productivity/index.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "SDTC Transition and Business Operations",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Commercializing innovation, defined projects with a strong end-user value proposition, attracting a consortia partner, demonstrating environmental and economic benefits for Canadians",
    "Eligible_Applicants": "Canadian companies with defined projects",
    "Eligible_Criteria": "Read the comprehensive booklet for applications, eligibility requirements, and funding details",
    "Description": "The Government of Canada announced the transition of SDTC to the National Research Council of Canada. SDTC will resume full business operations with a focus on funding qualified small to medium sized Canadian companies with compelling innovation for commercialization.",
    "Summary": "SDTC provides funding to Canadian companies with initiatives offering environmental and economic benefits. The average contribution is between $2 million and $4 million.",
    "Grant_Goals": "To support emerging Canadian companies in commercializing sustainable technologies with environmental and economic benefits.",
    "Eligible_Industries": "all",
    "Link": "https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Regional Economic Growth through Innovation (REGI)",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Atlantic Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "scale up and expand, make the most of new technologies, improve productivity, create new products and find new markets",
    "Eligible_Applicants": "Business Scale Up: sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises | Regional Innovation Ecosystems: post-secondary educational institutions, accelerators and business incubators, angel networks, social enterprises, a group of eligible recipients such as an industry association or consortium, a municipality and all other municipal-type organizations, community-owned Indigenous businesses",
    "Eligible_Criteria": "Contact your nearest ACOA office to discuss your project and then complete and submit the Application for financial assistance.",
    "Description": "The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada. Through REGI, the Atlantic Canada Opportunities Agency (ACOA) is helping businesses and non-profit organizations develop a strong, dynamic and inclusive economy.",
    "Summary": "The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada. It offers two funding options: Business Scale-up and Productivity, and Regional Innovation Ecosystems.",
    "Grant_Goals": "To create strong and inclusive regional networks to fuel growth and innovation in Atlantic Canada.",
    "Eligible_Industries": "all",
    "Link": "https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Voucher Program",
    "Amount": 100000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments, Other technology development activities",
    "Eligible_Applicants": "For profit organization that is incorporated, or a partnership registered in Alberta with fewer than 500 full-time employees",
    "Eligible_Criteria": "You have fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue. You are a for profit organization that is incorporated, or a partnership registered in Alberta. You can contribute a minimum of 25 per cent cash contribution of the total eligible project costs. You have a new, unique technology or innovation that is patentable working toward commercialization.",
    "Description": "The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit. The Voucher Program can help cover the costs of up to three contracted service providers for the purpose of business and technology development.",
    "Summary": "The Voucher Program provides Alberta tech companies with up to $100,000 to accelerate new product commercialization. It can help cover the costs of up to three contracted service providers for business and technology development.",
    "Grant_Goals": "To accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Micro Voucher Program",
    "Amount": 10000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Design, engineering, and prototype development. Product testing and refinement. Patent development; (excluding patent maintenance fees). Advanced market assessment or segmentation analysis. Certifications. Advanced business and/or marketing strategies. Other technology development activities that will be considered on a case-by-case basis.",
    "Eligible_Applicants": "Small to Medium Enterprise with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.",
    "Eligible_Criteria": "Consult the Program Guide for all eligibility requirements. Connect with Alberta Innovates for application details.",
    "Description": "The Micro Voucher Program helps Alberta tech companies to design and/or develop innovative technology solutions by providing up to $10,000 in non-dilutive funding.",
    "Summary": "The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.",
    "Grant_Goals": "To help Alberta tech companies design and/or develop innovative technological solutions",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Product Demonstration Program",
    "Amount": 150000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 50000000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Build a relationship with a strategic partner, validate product to a potential customer or market, have first sale or increase sales revenue within 18 months, expand supply or distribution channels, increase global competitiveness, provide strategic partner with access to innovative products, help strategic partner to de-risk exposure to new technology, expand products in strategic partners’ distribution channels",
    "Eligible_Applicants": "Small to Medium Enterprise tech companies in Alberta",
    "Eligible_Criteria": "You have a product ready to pilot in an operational setting, are looking to expand sales or broaden market segments, have identified a potential strategic partner, can complete the pilot or demonstration within one year, can reasonably expect a first sale or distribution agreement within 18 months if the pilot is successful, can reasonably expect expanded sales or distribution agreements if the demonstration is successful within 18 months",
    "Description": "The Product Demonstration Program supports Alberta tech companies commercialize their products and achieve optimal market position to increase revenue and expand into global markets.",
    "Summary": "The Product Demonstration Program provides up to $150,000 to Alberta tech companies for product pilot or demonstration that proves their product’s technical and business merits, in partnership with a strategic partner.",
    "Grant_Goals": "To help Alberta tech companies commercialize their products and achieve optimal market position.",
    "Eligible_Industries": "technology",
    "Link": "https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Commercialization Consulting and Mentoring Program",
    "Amount": 16250,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Nova Scotia",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Hire consultants or mentors, host group learning activities",
    "Eligible_Applicants": "Small or medium sized business, University or Community College, Research institution",
    "Eligible_Criteria": "Eligible activities must support the commercialization of a new and innovative product, technology, or process. Costs incurred prior to submission will not be eligible.",
    "Description": "The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.",
    "Summary": "Receive up to $16,250 (65% of project costs) to hire consultants or mentors and host group learning activities.",
    "Grant_Goals": "To help businesses and institutions in the final stages of commercialization.",
    "Eligible_Industries": "all",
    "Link": "https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Business Scale-Up and Productivity",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Acquisition of digital production equipment or machinery and infrastructure, Assessment, adaptation or adoption of new technologies or new production processes, Activities aimed at boosting productivity and production or innovation capacity, Commercialization and market development, Implementation of commercialization strategies: Participation in trade fairs, Prospecting visits, Hiring of marketing staff, Ad campaigns, Market diagnostics and studies, Technology showcasing and demonstration, Business management, Hiring of resources to set up top-performing teams, Adoption of best management practices, processes and systems (e.g., Enterprise Resource Planning), Other activities may also be eligible. Contact us to discuss your project.",
    "Eligible_Applicants": "SMEs, NPOs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, Indigenous organizations",
    "Eligible_Criteria": "Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk",
    "Description": "This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program. Financial assistance is generally of up to 50% of authorized costs for SMEs and repayable without interest. For NPOs, non-repayable financial assistance is generally of up to 90% of authorized costs (up to 50% of authorized costs in the case of capital projects).",
    "Summary": "The Business Scale-Up and Productivity funding aims to foster innovation and business growth for SMEs or NPOs at any stage of their development.",
    "Grant_Goals": "To foster expansion, productivity and growth through innovation.",
    "Eligible_Industries": "manufacturing,food processing,information, communications & multimedia technologies,life sciences",
    "Link": "https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Alberta Export Expansion Program",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "International trade events and travel",
    "Eligible_Applicants": "Alberta small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations",
    "Eligible_Criteria": "Details for eligibility can be found on the program website",
    "Description": "The Alberta Export Expansion Program (AEEP) supports export-ready companies and non-profit organizations to enhance access to international markets and attract global buyers.",
    "Summary": "The AEEP provides funding to offset travel-related costs as companies diversify into new international markets.",
    "Grant_Goals": "Enhancing international trade and supporting Alberta's economic success",
    "Eligible_Industries": "all",
    "Link": "https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Ignite",
    "Amount": 300000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "British Columbia",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Research and development of a new, innovative technology in natural resources, engineering, or applied sciences",
    "Eligible_Applicants": "Teams of academia and industry working on projects in the areas of natural resources and applied sciences",
    "Eligible_Criteria": "Follow these steps to apply for Ignite: 1. Ensure the project meets the eligibility criteria listed. 2. Secure matching funds from industry or government sources at a ratio of 2:1. 3. Complete the application form and submit all required documentation.",
    "Description": "The Ignite program provides funding to support the research and development of innovative technology solutions in natural resources, engineering, and applied sciences with strong market potential and commercialization plan.",
    "Summary": "Teams of academia and industry can receive up to $300,000 for research and development projects in natural resources, engineering, and applied sciences through the Ignite program.",
    "Grant_Goals": "To support the research and development of innovative technology solutions in natural resources, engineering, and applied sciences with strong market potential and commercialization plan.",
    "Eligible_Industries": "natural resources,engineering,applied sciences",
    "Link": "https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "IDEaS",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Solving defence and security challenges, technology development, idea stimulation, competition participation, testing innovative solutions",
    "Eligible_Applicants": "Canadian innovators, technology developers, solution providers, defence and security experts",
    "Eligible_Criteria": "Participate in Calls for Proposals, ongoing updates, technology testing by the Department of National Defence",
    "Description": "IDEaS is a program that provides funding and support for Canadian innovators to solve defence and security challenges through technology development, idea stimulation, competition participation, and testing innovative solutions.",
    "Summary": "IDEaS offers funding mechanisms including competitive projects, innovation networks, contests, sandboxes, and test drives to assist Canadian innovators in solving defence and security challenges.",
    "Grant_Goals": "To accelerate concepts and propel solutions forward, building a defence innovation ecosystem",
    "Eligible_Industries": "all",
    "Link": "https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Canada-Alberta Job Grant",
    "Amount": 15000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Alberta",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training programs",
    "Eligible_Applicants": "Employers in Alberta",
    "Eligible_Criteria": "Refer to the Canada-Alberta Job Grant Applicant Guide for complete eligibility criteria.",
    "Description": "The Canada-Alberta Job Grant is a training program where an employer applies on behalf of their present or future employees for eligible training costs.",
    "Summary": "The Canada-Alberta Job Grant provides funding for employers to train their present or future employees.",
    "Grant_Goals": "To provide government funding to help employees and unemployed Albertans access training opportunities.",
    "Eligible_Industries": "all",
    "Link": "https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Starter Company Plus",
    "Amount": 5000,
    "Deadline": "2024-02-07",
    "Eligible_Region": "Ontario",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Business workshops, seminars, networking events, mentorship",
    "Eligible_Applicants": "Ontario residents and Canadian citizens, 18 years or older, not attending school full-time",
    "Eligible_Criteria": "Apply through a Small Business Enterprise Centre",
    "Description": "Starter Company Plus provides training, mentoring, and grants of up to $5,000 for starting, expanding, or buying a small business in Ontario.",
    "Summary": "Starter Company Plus offers support through training, mentoring, and grants for entrepreneurs in Ontario.",
    "Grant_Goals": "Supporting a strong, innovative economy and small business in Ontario",
    "Eligible_Industries": "all",
    "Link": "https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Aboriginal Business Financing Program (ABFP)",
    "Amount": 99999,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Start-up, acquisition or expansion of a business, Implementation of marketing activities, Project-related management, Professional advisory services after the business is launched",
    "Eligible_Applicants": "FIRST NATIONS, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC",
    "Eligible_Criteria": "Be a member of a First Nation or the Native Alliance of Quebec, have the necessary financial resources, present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, operate a business not involved in gambling, sex, alcohol, tobacco",
    "Description": "Non-refundable contribution for First Nations or the Native Alliance of Quebec to support start-up, acquisition, or expansion of businesses, marketing activities, project management, professional advisory services, and development of business plans, marketing plans, or feasibilities studies.",
    "Summary": "The Aboriginal Business Financing Program (ABFP) provides a non-refundable contribution of up to $99,999 for eligible First Nations or the Native Alliance of Quebec to support various business activities.",
    "Grant_Goals": "Supporting First Nations and the Native Alliance of Quebec in their business endeavors",
    "Eligible_Industries": "all",
    "Link": "https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Grant for Nunavut Employers",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Nunavut",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Training or professional development for Nunavummiut leading to new positions, promotions, increased pay, or regular employment",
    "Eligible_Applicants": "Registered Nunavut-based employers who have a position available for the trainee to advance into after training and can contribute at least one-third of the total eligible training expenses",
    "Eligible_Criteria": "For application forms or more information, contact CareerDevelopment-TLMP@gov.nu.ca",
    "Description": "The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.",
    "Summary": "The Grant for Nunavut Employers covers two-thirds of the eligible costs for each trainee, subject to availability, and is provided as a reimbursement to the employer based on the successful completion of training.",
    "Grant_Goals": "To encourage employers to provide training or professional development leading to employment opportunities for Nunavummiut",
    "Eligible_Industries": "all",
    "Link": "https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "First Nations Business Readiness Training",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Management and marketing skills development",
    "Eligible_Applicants": "First Nations entrepreneurs",
    "Eligible_Criteria": "Submission of application with purpose of the course, course outline, and detailed budget; approach to other First Nation educational funding agencies; training through approved organizations specific to business management",
    "Description": "Supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills.",
    "Summary": "Supports rapid business readiness training for First Nations entrepreneurs",
    "Grant_Goals": "To develop the management and marketing skills of First Nations entrepreneurs",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Support to Manitoba First Nation individuals or First Nation-based enterprises",
    "Amount": 20000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Research and development of a quality business plan",
    "Eligible_Applicants": "Member of a Manitoba First Nation, living on or off reserve in Manitoba, aged 18 and over, and eligible to work in Canada",
    "Eligible_Criteria": "Approval of funding is required prior to consultant commencing the assignment",
    "Description": "This program is intended to provide support to Manitoba First Nation individuals or First Nation-based enterprises which, in the opinion of the Fund, have a business concept that provides an excellent opportunity but demonstrates a need for financial assistance with a professional business plan.",
    "Summary": "This program allows the applicant to engage the services of a professional consultant to assist in the research and development of a quality business plan that will be used to attract financing.",
    "Grant_Goals": "To provide support and financial assistance with a professional business plan",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "NON-REPAYABLE BUSINESS CONTRIBUTION FUND",
    "Amount": 250000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Manitoba",
    "Eligible_Profitable": "Coming Soon",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Contributions towards start-up, expansion, or acquisition of a viable business, development of an independent business plan, environmental assessments, marketing costs, and business support.",
    "Eligible_Applicants": "First Nation individuals, Manitoba First Nation Community, or group of Manitoba First Nations",
    "Eligible_Criteria": "To be eligible, the business must meet specific ownership requirements, show viability and management capacity through the submission of a business plan, and adhere to guidelines set forth by the program.",
    "Description": "The Business Contribution Fund provides non-repayable financial support to eligible First Nation businesses in Manitoba, offering contribution towards start-up, expansion, or acquisition of a viable business, development of an independent business plan, environmental assessments, marketing costs, and business support.",
    "Summary": "The Business Contribution Fund (BCF) offers non-repayable financial support to eligible First Nation businesses in Manitoba, contributing to business viability and expansion.",
    "Grant_Goals": "To support the growth and development of First Nation businesses in Manitoba.",
    "Eligible_Industries": "all",
    "Link": "https://www.firstpeoplesfund.ca/business_contribution_fund.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Business scale-up and productivity",
    "Amount": "Coming Soon",
    "Deadline": "2024-03-31",
    "Eligible_Region": "Quebec",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Acquisition of digital production equipment or machinery, assessment, adaptation or adoption of new technologies or production processes, boosting productivity, commercialization, market development, technology showcasing, business management",
    "Eligible_Applicants": "SMEs, NPOs, co-ops, business associations, business support organizations, indigenous organizations",
    "Eligible_Criteria": "Projects are analyzed against specific criteria such as expected results, viability of the business/organization, technical and financial management capacity, contribution of partners, and degree of risk.",
    "Description": "Funding to foster innovation and business growth, provided under the REGI program. Eligible costs must be essential to the project. Restrictions exist for certain cases. Ineligible costs include non-essential costs not directly related to the project.",
    "Summary": "Financial assistance for SMEs generally up to 50% of authorized costs, repayable without interest. For NPOs, non-repayable financial assistance generally up to 90% of authorized costs.",
    "Grant_Goals": "Foster innovation and business growth through financial assistance for eligible projects.",
    "Eligible_Industries": "manufacturing,food processing,information, communications and multimedia technologies,life sciences",
    "Link": "https://ced.canada.ca/eng/programs/regi/productivity/index.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  }
]