[
  {
    "Name": "CanExport SMEs",
    "Amount": 50000,
    "Deadline": "2024-05-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Gathering market intelligence, Applying for intellectual property protection, Applying for certification, Seeking expert legal and business advice, Search Engine Optimization, Translating or creating marketing materials, Attending virtual trade shows, Visits to foreign markets, In-person participation at trade shows, Participating in a trade mission",
    "Eligible_Applicants": "For-profit businesses, incorporated legal entities, limited liability partnerships (LLP), cooperatives with an active Canada Revenue Agency business number, employing fewer than 500 full-time equivalent employees, having $100,000 to $100 million in declared revenue in Canada during its past fiscal year",
    "Eligible_Criteria": "Applicant's guide",
    "Description": "CanExport SMEs is accepting applications to help Canadian small and medium-sized enterprises break into international markets with a non-repayable contribution of up to $50,000. It covers up to 50% of eligible costs for activities such as gathering market intelligence, intellectual property protection, certification, legal and business advice, search engine optimization, marketing materials, virtual trade shows, and more.",
    "Summary": "CanExport SMEs provides financial support to enable Canadian SMEs to grow globally, with a focus on non-travel activities and market entry preparation.",
    "Grant_Goals": "To help Canadian small and medium-sized enterprises break into international markets",
    "Eligible_Industries": "all",
    "Link": "https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Mitacs Accelerate Fellowship",
    "Amount": 15000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "No",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Research projects in collaboration with students, graduate students, recent grads, and postdocs.",
    "Eligible_Applicants": "For-profit corporations, eligible not-for-profit corporations, municipalities, hospitals, and full-time graduate students in select Mitacs partner countries.",
    "Eligible_Criteria": "Detailed application process with specific requirements and digital application option.",
    "Description": "The Mitacs Accelerate Fellowship program provides funding and pairs partner organizations with top-level research talent to achieve business and innovation goals.",
    "Summary": "The Mitacs Accelerate Fellowship program supports collaborative research projects and provides funding for applied research with partner organizations.",
    "Grant_Goals": "To support R&D and innovation by connecting partner organizations with skilled students and postdocs.",
    "Eligible_Industries": "all",
    "Link": "https://www.mitacs.ca/en/programs/accelerate#business?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  },
  {
    "Name": "Financial support for technology innovation",
    "Amount": 10000000,
    "Deadline": "2024-03-31",
    "Eligible_Region": "Canada",
    "Eligible_Profitable": "Yes",
    "Eligible_Revenue": 100000,
    "Eligible_Employees": 2,
    "Eligible_Activities": "Research and development projects at various stages of the innovation cycle",
    "Eligible_Applicants": "Incorporated, profit-oriented small or medium-sized businesses in Canada with 500 or fewer full-time equivalent employees",
    "Eligible_Criteria": "Connect with NRC IRAP by calling 1-877-994-4727 to find out if your business is eligible for NRC IRAP support.",
    "Description": "NRC IRAP provides funding to support research and development projects at various stages of the innovation cycle. In 2018‑2019, NRC IRAP was mandated to expand its support to include an increased funding threshold of up to $10 million for larger research and development projects.",
    "Summary": "NRC IRAP provides financial support for small or medium‑sized Canadian businesses pursuing technology‑driven innovation, including an increased funding threshold of up to $10 million.",
    "Grant_Goals": "To help recipients of NRC IRAP funding achieve transformative growth within 5 years of completing their projects and significantly benefit Canada's economy",
    "Eligible_Industries": "technology",
    "Link": "https://nrc.canada.ca/en/support-technology-innovation/financial-support-technology-innovation-through-nrc-irap?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"
  }
]