[{"Name":"First Peoples Economic Growth Fund Inc.","Amount":20000,"Deadline":"Continuous","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of a quality business plan, hiring a professional consultant, developing a business concept summary","Eligible_Applicants":"Manitoba First Nation individuals or First Nation-based enterprises, aged 18 and over, eligible to work in Canada, not have owned a similar business in the past 12 months","Eligible_Criteria":"Must submit an application describing the business for which they wish to develop a business plan, provide the name and qualifications of the proposed consultant, proposed terms of reference and a written proposal, including a quote","Description":"This program provides support to Manitoba First Nation individuals or First Nation-based enterprises by covering up to 75% of the costs associated with hiring a professional consultant to assist in the research and development of a quality business plan","Summary":"Up to $20,000 non-repayable funding available to cover up to 75% of the costs associated with hiring a professional consultant to develop a business plan","Grant_Goals":"To provide financial assistance with a professional business plan","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Sustainable Development Technology Canada","Amount":"Coming Soon","Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Project with strong end-user value proposition and potential to attract a consortia partner to validate the market need.","Eligible_Applicants":"Canadian companies with defined projects that demonstrate environmental and economic benefits for Canadians.","Eligible_Criteria":"Details about the application process and eligibility criteria are available in the How to Apply guide provided by Sustainable Development Technology Canada.","Description":"Sustainable Development Technology Canada (SDTC) provides funding to Canadian companies with defined projects that demonstrate environmental and economic benefits for Canadians.","Summary":"SDTC funding supports innovative projects that have the potential to contribute to sustainable development and economic growth in Canada.","Grant_Goals":"To support the development and commercialization of innovative projects with environmental and economic benefits for Canadians.","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":"Coming Soon","Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up and expand, make the most of new technologies, improve productivity, create new products, find new markets, support businesses at each stage of development","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations, post-secondary educational institutions, accelerators, business incubators, angel networks, social enterprises, a group of eligible recipients such as an industry association or consortium, a municipality and all other municipal-type organizations, community-owned Indigenous businesses","Eligible_Criteria":"Contact your nearest ACOA office to discuss your project and then complete and submit the Application for financial assistance.","Description":"The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada. Through REGI, the Atlantic Canada Opportunities Agency (ACOA) is helping businesses and non-profit organizations develop a strong, dynamic and inclusive economy.","Summary":"The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada.","Grant_Goals":"To create strong and inclusive regional networks to fuel growth and innovation.","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Continuous","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, leading-edge design, engineering and prototype development, advanced product testing and refinement, patent development, advanced market assessments, other technology development activities","Eligible_Applicants":"For-profit organization incorporated or a partnership registered in Alberta, with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Consult the Program Guide","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit. It can help cover the costs of up to three contracted service providers for business and technology development related activities.","Summary":"The Voucher Program provides up to $100,000 for Alberta tech companies to accelerate new product commercialization.","Grant_Goals":"To accelerate new product commercialization for Alberta tech companies","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Continuous","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development, product testing and refinement, patent development, advanced market assessment, certifications, advanced business and marketing strategies, other technology development activities","Eligible_Applicants":"Small to Medium Enterprises with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Visit the Program Guide for a complete list of all eligibility requirements","Description":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Summary":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Grant_Goals":"To help Alberta tech companies design and/or develop innovative technological solutions","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Continuous","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Enter a partnership with a strategic partner to conduct a product pilot or demonstration that proves their product’s technical and business merits.","Eligible_Applicants":"You have fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.","Eligible_Criteria":"Consult the Program Guide for full details.","Description":"The Product Demonstration Program supports Alberta tech companies to commercialize their products and achieve optimal market position to increase revenue and expand into global markets.","Summary":"The Product Demonstration Program provides up to $150,000 to Alberta tech companies to conduct a product pilot or demonstration to validate and expand their products.","Grant_Goals":"To support Alberta tech companies in commercializing their products and expanding into global markets.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence (custom research, reports and studies), Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences, Visits to foreign markets, In-person participation at trade shows, networking functions, meetings or conferences, Participating in a trade mission","Eligible_Applicants":"Eligible Canadian small and medium-sized enterprises must: be for-profit, be an incorporated legal entity, limited liability partnership (LLP) or cooperative, have an active Canada Revenue Agency business number, employ fewer than 500 full-time equivalent employees, have $100,000 to $100 million in declared revenue in Canada during its past fiscal year (or 12 months for quarterly filers)","Eligible_Criteria":"Coming Soon","Description":"CanExport SMEs is a funding program that supports non-travel and travel activities for eligible Canadian small and medium-sized enterprises to help them expand internationally. The program aims to provide financial assistance for activities such as market intelligence gathering, intellectual property protection, certification in international markets, expert legal and business advice, search engine optimization, and translation or adaptation of marketing materials. The program also supports virtual and in-person participation in trade shows, networking functions, meetings, conferences, and trade missions. Eligible applicants must be for-profit, incorporated legal entities, LLPs, or cooperatives with an active Canada Revenue Agency business number, fewer than 500 full-time equivalent employees, and $100,000 to $100 million in declared revenue in Canada.","Summary":"CanExport SMEs provides funding to support Canadian small and medium-sized enterprises in their international expansion efforts through financial assistance for non-travel and travel activities. Eligible activities include market intelligence gathering, intellectual property protection, certification, expert advice, search engine optimization, and participation in trade-related events. To be eligible, applicants must meet certain criteria, including being for-profit, having an active Canada Revenue Agency business number, and meeting revenue and employee thresholds.","Grant_Goals":"To provide financial support for Canadian small and medium-sized enterprises to expand into global markets through various non-travel and travel activities.","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting and Mentoring","Amount":16250,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hire consultants or mentors to help get a new and innovative product, technology, or process to market. Host group learning activities that will improve knowledge and preparedness for commercialization.","Eligible_Applicants":"Small or medium sized business, University or Community College, Research institution (excluding Federal labs)","Eligible_Criteria":"Applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible. Once the application is approved, costs incurred as of the date that the application was received by LearnSphere will be deemed admissible. Please note that meeting the eligibility criteria does not guarantee you will receive funding. Each eligible application will be subject to an evaluation process. A maximum of two projects is allowed per technology. Activities in a second project must demonstrate a progressive, incremental activity, and must not be a continuation of a previous project.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization. CCM is open to all industry sectors, except retail/wholesale, real estate, government services, personal or social services and softwood lumber.","Summary":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Grant_Goals":"To help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business Scale-Up and Productivity Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment, assessment of new technologies, boosting productivity, commercialization, technology showcasing, business management, adoption of best management practices, hiring of top-performing teams","Eligible_Applicants":"SMEs, Co-ops, Business associations, non-profit organizations (NPOs), Business support organizations, Indigenous organizations","Eligible_Criteria":"Projects are analyzed against specific criteria including expected results, viability of the business or organization, technical and financial management capacity, contribution of partners, and degree of risk","Description":"This funding aims to foster innovation and business growth at any stage of a business’s development. It provides financial assistance for fostering expansion, productivity, and growth through innovation. The funding is provided under the Regional Economic Growth through Innovation program (REGI).","Summary":"The Business Scale-Up and Productivity Funding supports SMEs and NPOs in Quebec to foster expansion, productivity, and growth through innovation at any stage of their development.","Grant_Goals":"To foster innovation and business growth","Eligible_Industries":["Manufacturing","Food processing","Information, communications and multimedia technologies","Life sciences"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International travel to formal outbound trade events.","Eligible_Applicants":"Alberta companies and non-profits","Eligible_Criteria":"Coming Soon","Description":"Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Summary":"The Alberta Export Expansion Program supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, and economic development organizations that promote Alberta exports through international travel to formal outbound trade events.","Grant_Goals":"Enhancing international trade","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of innovative technology in natural resources, engineering, or applied sciences","Eligible_Applicants":"Teams of academia and industry working on projects in the areas of natural resources and applied sciences","Eligible_Criteria":"The project must meet specific eligibility criteria outlined in the program guidelines and must secure matching funds from industry or government sources at a 2:1 ratio.","Description":"The Ignite program supports collaborative projects between academia and industry in British Columbia for research and development of innovative technology with strong market potential.","Summary":"The Ignite program provides up to $300,000 in funding for collaborative projects focusing on natural resources, engineering, and applied sciences in British Columbia.","Grant_Goals":"To support the commercialization of innovative technology solutions in the natural resources, engineering, and applied sciences sectors.","Eligible_Industries":["natural resources","engineering","applied sciences"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Shipping technology to determine feasibility/compatibility with a partner's technology, Translating, adapting and creating promotional plans or materials, Attending virtual networking functions, meetings or conferences, Travel abroad or in Canada to meet with pre-identified foreign partners, Attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Familiarize yourself with the program details by reading our Applicant’s Guide. 2. Create an account on our online portal. 3. Note: Not compatible with Internet Explorer. 4. Once you are signed in, enter your information under My Profile and select Update. 5. On the CanExport Innovation landing page, select Apply Now!","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides up to $75,000 in funding to assist with research and development for a single technology. They cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Grant_Goals":"To assist with research and development for a single technology","Eligible_Industries":["technology"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"IDEaS Innovation Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Developing innovative solutions for defence and security challenges","Eligible_Applicants":"Canadian innovators focused on defence and security technologies","Eligible_Criteria":"Join the mailing list to receive emails for new Calls for Proposals and ongoing updates","Description":"IDEaS is more than just a funding program; it accelerates concepts and propels solutions forward, building a defence innovation ecosystem.","Summary":"IDEaS provides five funding mechanisms to assist Canadian innovators in solving defence and security challenges.","Grant_Goals":"To propel technology forward and stimulate critical ideas for defence and security innovations","Eligible_Industries":["technology","security","defense"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":15000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training costs for existing employees, hiring and training unemployed Albertans","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations and Metis Settlements, Agriculture Financial Services Corporation, Alberta Treasury Branches","Eligible_Criteria":"Refer to the Canada-Alberta Job Grant Applicant Guide for complete eligibility criteria","Description":"The Canada-Alberta Job Grant is a training program where an employer applies on behalf of their present or future employees for eligible training costs. The program covers two-thirds of the cost to a maximum of $15,000 per trainee per fiscal year.","Summary":"The Canada-Alberta Job Grant provides government funding to help employees and unemployed Albertans access training opportunities. Employers contribute at least one-third of the total training costs for existing employees.","Grant_Goals":"Training employees to fill current or future positions","Eligible_Industries":[],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Participate in business workshops, seminars or networking events covering various topics.","Eligible_Applicants":"Ontario residents and Canadian citizens or permanent residents, 18 years of age or older, not attending school full-time or returning to school.","Eligible_Criteria":"Apply through a Small Business Enterprise Centre. Able to make a contribution in cash or in kind equivalent to at least 25% of the grant amount.","Description":"Starter Company Plus offers training, mentoring, and a grant of up to $5,000 for individuals starting, expanding, or buying a small business in Ontario.","Summary":"Starter Company Plus program provides one-on-one guidance, workshops, seminars, and networking events, along with a grant of up to $5,000 for eligible individuals.","Grant_Goals":"To support individuals in starting, expanding, or buying small businesses in Ontario.","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"Yes","Eligible_Revenue":0,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, development of a business plan, marketing plan or feasibilities studies","Eligible_Applicants":"FIRST NATIONS and corporations owned by a First Nation or the Native Alliance of Quebec or by one of their members","Eligible_Criteria":"Be a First Nation or the Native Alliance of Quebec, have the necessary financial resources, present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, operate a business not involved in gambling, sex, alcohol, or tobacco","Description":"The Aboriginal Business Financing Program (ABFP) provides a non-refundable contribution for start-up, expansion, and management of businesses for First Nations and related corporations.","Summary":"ABFP provides up to $99,999 for eligible activities such as start-up, expansion, and professional advisory services for First Nations and related corporations in Quebec.","Grant_Goals":"To support economic development and business growth within the First Nations community in Quebec","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training or professional development for Nunavummiut","Eligible_Applicants":"Registered Nunavut-based employers","Eligible_Criteria":"Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Summary":"The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Grant_Goals":"To encourage employers to provide training or professional development, leading to new opportunities for Nunavummiut.","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Rapid Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business management and marketing skills training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Applicants must submit an application that includes the purpose of the course as well as a course outline and a detailed budget. The applicant should have approached other First Nation educational funding agencies prior to applying to the Fund. Training must be through qualified trainers or organizations that have been approved by the Fund to provide appropriate training. Training must be specific to business management and not occupational training unrelated to the development of management and marketing skills. On-the-job training may qualify to better fit the needs of the entrepreneur or manager of a First Nation-owned business.","Description":"The program supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills. Funding is available up to 75% of the approved costs, covering only direct course costs such as tuition, workshop fees, and books. Living expenses are not included, and the program is not intended to finance the acquisition of a degree or certificate.","Summary":"The Rapid Business Readiness Training program supports First Nations entrepreneurs in developing their management and marketing skills through funding for specific training costs.","Grant_Goals":"To develop management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business Support Program","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of a quality business plan, engaging services of a professional consultant","Eligible_Applicants":"Manitoba First Nation individuals or First Nation-based enterprises, aged 18 and over, eligible to work in Canada","Eligible_Criteria":"Approval of funding is required prior to consultant commencing the assignment","Description":"This program is intended to provide support to Manitoba First Nation individuals or First Nation-based enterprises through initial screening and financial assistance with a professional business plan.","Summary":"The Business Support Program offers funding up to $20,000, non-repayable, to develop quality business plans for eligible applicants.","Grant_Goals":"Provide support to Manitoba First Nation individuals or First Nation-based enterprises","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Innovation commercialization, business expansion, new product line development","Eligible_Applicants":"Canadian companies with defined projects, strong end-user value proposition, potential to attract a consortia partner, and demonstrated environmental and economic benefits for Canadians","Eligible_Criteria":"Check eligibility requirements for SDTC funding and download comprehensive booklet for application process","Description":"SDTC funding aims to support sustainable innovation and commercialization projects in Canada, providing up to 40% of eligible project costs with contributions between $2 million and $4 million disbursed over five years or less. Private sector contributions and Canadian project costs are requirements.","Summary":"SDTC funding provides support for sustainable innovation and commercialization projects in Canada, offering up to 40% of eligible project costs with contributions between $2 million and $4 million disbursed over five years or less.","Grant_Goals":"To establish a growing pipeline of emerging companies in sustainability and support projects with environmental and economic benefits for Canadians","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":0,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up and expand, make the most of new technologies, improve productivity, create new products and find new markets","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations that offer services to businesses, post-secondary educational institutions, accelerators and business incubators, angel networks, social enterprises, a group of eligible recipients such as an industry association or consortium, a municipality and all other municipal-type organizations, community-owned Indigenous businesses","Eligible_Criteria":"Contact your nearest ACOA office to discuss your project and then complete and submit the Application for financial assistance. If you're an Indigenous youth or woman, or if you lead a community-owned Indigenous business, you could get extra support. Contact us to see if you qualify for more funding or flexible repayment options.","Description":"The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada. It helps businesses and non-profit organizations develop a strong, dynamic and inclusive economy. REGI offers two options for funding: Business Scale-up and Productivity, and Regional Innovation Ecosystems.","Summary":"The Regional Economic Growth through Innovation (REGI) program helps businesses and non-profit organizations develop a strong, dynamic, and inclusive economy in Atlantic Canada by providing funding for Business Scale-up and Productivity, and Regional Innovation Ecosystems.","Grant_Goals":"To create the right conditions to start and grow businesses in Atlantic Canada and to help businesses and non-profit organizations develop a strong, dynamic, and inclusive economy.","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments, Other technology development activities may be considered on a case-by-case basis","Eligible_Applicants":"For profit organization that is incorporated, or a partnership registered in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"For more information, consult the Program Guide","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit.","Summary":"The Voucher Program provides up to $100,000 to accelerate new product commercialization for Alberta tech companies.","Grant_Goals":"To accelerate new product commercialization for Alberta tech companies","Eligible_Industries":["technology","all"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development, product testing and refinement, patent development, advanced market assessment or segmentation analysis, certifications, advanced business and/or marketing strategies, other technology development activities that will be considered on a case-by-case basis","Eligible_Applicants":"Small to Medium Enterprise tech companies based in Alberta with fewer than 500 full-time employees and annual gross revenue less than $50,000,000","Eligible_Criteria":"Complete list of eligibility requirements in the Program Guide","Description":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Summary":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Grant_Goals":"To help Alberta tech companies design and/or develop innovative technological solutions.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Build a relationship with a strategic partner, Validate your product to a potential customer or market, Have your first sale or increase sales revenue within 18 months post project, Expand your supply or distribution channels, Increase your global competitiveness, Provide your strategic partner with access to innovative products to solve operational challenges for itself or its customers, Help your strategic partner to de-risk exposure to new technology, Expand products in strategic partners’ distribution channels","Eligible_Applicants":"Alberta tech companies with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue, looking to enter a partnership with a strategic partner to conduct a product pilot or demonstration","Eligible_Criteria":"You have fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue, You can match the total eligible project costs, to a maximum Investment of $150,000, You have a product is ready to pilot in an operational setting, You are looking to expand sales or broaden market segments, You have identified a potential strategic partner, You can complete the pilot or demonstration within one year, You can reasonably expect a first sale or distribution agreement within 18 months if the pilot is successful, You can reasonably expect expanded sales or distribution agreements if the demonstration is successful within 18 months","Description":"The Product Demonstration Program supports Alberta tech companies to commercialize their products and achieve optimal market position, increasing revenue, and expanding into global markets. Companies may be eligible for up to $150,000 to enter a partnership with a strategic partner to conduct a product pilot or demonstration.","Summary":"The Product Demonstration Program provides up to $150,000 to Alberta tech companies looking to commercialize their products and achieve optimal market position.","Grant_Goals":"To support Alberta tech companies in commercializing their products and expanding into global markets","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence (custom research, reports and studies), Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences, Visits to foreign markets, In-person participation at trade shows, networking functions, meetings or conferences, Participating in a trade mission","Eligible_Applicants":"Incorporated Canadian for-profit businesses <500 full-time payroll employees and between $100,000-$100M in Canadian annual revenue","Eligible_Criteria":"Please visit CanExport SMEs applicant's guide for more details on how to apply.","Description":"CanExport SMEs is an initiative that supports non-travel activities to help Canadian small and medium-sized enterprises expand internationally.","Summary":"CanExport SMEs offers funding to support non-travel activities for Canadian SMEs looking to grow into global markets.","Grant_Goals":"To help Canadian small and medium-sized enterprises expand internationally into global markets.","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting and Mentoring Program","Amount":16250,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hiring consultants or mentors, hosting group learning activities","Eligible_Applicants":"Small or medium sized businesses, Universities, Community Colleges, Research institutions (excluding Federal labs)","Eligible_Criteria":"Applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Summary":"The Commercialization Consulting and Mentoring Program provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Grant_Goals":"To help Atlantic Canadian businesses and institutions in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"REGI program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery, assessment, adaptation or adoption of new technologies or new production processes, boosting productivity and production or innovation capacity, commercialization and market development, implementation of commercialization strategies, participation in trade fairs, prospecting visits, hiring of marketing staff, ad campaigns, market diagnostics and studies, technology showcasing and demonstration, business management, hiring of resources to set up top-performing teams, adoption of best management practices, processes and systems","Eligible_Applicants":"SMEs, NPOs, Co-ops, Business associations, Business support organizations, Indigenous organizations","Eligible_Criteria":"Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk","Description":"This funding aims to foster innovation and business growth, and can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation.","Summary":"This funding provided under the REGI program aims to foster innovation and business growth for projects submitted by SMEs or NPOs, throughout various sectors including Manufacturing, Food processing, Information, communications and multimedia technologies, and Life sciences.","Grant_Goals":"To foster innovation and business growth through financial assistance for various eligible sectors.","Eligible_Industries":["manufacturing","food processing","information","communications and multimedia technologies","life sciences"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International travel to formal outbound trade events","Eligible_Applicants":"Alberta companies and non-profits","Eligible_Criteria":"For funding and eligibility details, contact program advisors.","Description":"The Alberta Export Expansion Program (AEEP) supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, and economic development organizations that promote Alberta exports through international travel to formal outbound trade events.","Summary":"The Alberta Export Expansion Program (AEEP) provides funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Grant_Goals":"Enhancing international trade for Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, and economic development organizations.","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of new innovative technology in natural resources, engineering, or applied sciences","Eligible_Applicants":"Teams of academia and industry working on projects in the areas of natural resources and applied sciences","Eligible_Criteria":"The project must meet specific eligibility criteria stated in the program guidelines","Description":"The Ignite program supports the research and development of innovative technology with market potential in natural resources, engineering, or applied sciences through collaboration between academia and industry","Summary":"The Ignite program provides funding of up to $300,000 for research and development projects focused on innovative technology in natural resources, engineering, or applied sciences","Grant_Goals":"To support the commercialization of innovative technology in natural resources, engineering, or applied sciences","Eligible_Industries":["natural resources","engineering","all"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, applying for certification in international markets, seeking expert legal and business advice, shipping technology to determine feasibility/compatibility with a partner's technology, translating, adapting and creating promotional plans or materials, attending virtual networking functions, meetings or conferences, travel abroad or in Canada to meet with pre-identified foreign partners, attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"To be eligible, the organization must be registered in Canada, have a Canada Revenue Agency (CRA) business number, own, co-own, or have decision-making authority over the intellectual property (IP) rights for the technology, have a prototype (Technology Readiness Level 4 or higher), and intend to commercially launch the technology within 5 years.","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides up to $75,000 to assist Canadian organizations with R&D for a single technology, covering up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Grant_Goals":"To assist Canadian organizations with research and development (R&D) for a single technology.","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Innovation for Defence Excellence and Security","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Competitive Projects, Innovation Networks, Contests, Sandboxes, Test Drives","Eligible_Applicants":"Canadian innovators","Eligible_Criteria":"Join the mailing list to receive ongoing updates and new Calls for Proposals.","Description":"IDEaS provides five funding mechanisms to assist Canadian innovators in solving defence and security challenges.","Summary":"IDEaS is accelerating concepts and propelling solutions forward, building a defence innovation ecosystem.","Grant_Goals":"To assist Canadian innovators in solving defence and security challenges","Eligible_Industries":["technology"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training and educational activities for employees","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations and Metis Settlements, the Agriculture Financial Services Corporation, Alberta Treasury Branches","Eligible_Criteria":"Refer to the Canada-Alberta Job Grant Applicant Guide for complete eligibility criteria","Description":"The Canada-Alberta Job Grant is a training program where employers can apply for government funding to support employees and unemployed Albertans in accessing training opportunities.","Summary":"The Canada-Alberta Job Grant provides funding for employers to support the training of current and future employees, with contributions from the Government of Canada and employers.","Grant_Goals":"To support employers in providing relevant training to fill current or future positions and to enhance the skills of their workforce.","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Participate in business workshops, seminars or networking events","Eligible_Applicants":"18 years of age or older, Ontario resident and Canadian citizen, not attending school full-time or returning to school","Eligible_Criteria":"You can apply through a Small Business Enterprise Centre","Description":"Apply for training, mentoring and a grant through our Starter Company Plus program. Get one-on-one guidance, participate in business workshops, talk to a mentor, and apply for a grant of up to $5,000. Available for starting a new company, expanding an existing company or buying a business in Ontario.","Summary":"Starter Company Plus provides training, mentoring, and a grant of up to $5,000 for starting, expanding, or buying a small business in Ontario.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians, with an additional mandate for small business.","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, development of a business plan, marketing plan or feasibilities studies","Eligible_Applicants":"First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, Native Alliance of Quebec","Eligible_Criteria":"Be a First Nation or the Native Alliance of Quebec, have the necessary financial resources, present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, operate a business not involved in gambling, sex, alcohol, tobacco","Description":"Non-refundable contribution for First Nations or the Native Alliance of Quebec members to support start-up, acquisition or expansion of businesses, marketing activities, project management and professional advisory services. The program provides up to $99,999 in funding for viable business projects.","Summary":"The Aboriginal Business Financing Program (ABFP) offers non-refundable contributions up to $99,999 to support business start-ups, expansions, marketing activities, and project management for First Nations and members of the Native Alliance of Quebec.","Grant_Goals":"To support the economic development of First Nations and the Native Alliance of Quebec through financial assistance for business initiatives.","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Providing training or professional development to Nunavummiut leading to a new position, a promotion, increased pay, or regular employment","Eligible_Applicants":"Registered Nunavut-based employers with a position available for the trainee to advance into after training, and can contribute at least one-third of the total eligible training expenses","Eligible_Criteria":"Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment. The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Summary":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Grant_Goals":"Encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"First Nations Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business management and marketing skills training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Applicants must submit a detailed application including the purpose of the course, a course outline, and a detailed budget. Training must be through approved organizations specific to business management.","Description":"Supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills. Funding is available for direct course costs such as tuition, workshop fees, and books.","Summary":"Supports First Nations entrepreneurs in developing management and marketing skills through funding for direct course costs.","Grant_Goals":"To develop management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Manitoba First Nation Business Support","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of a business plan, engaging the services of a professional consultant, submitting a business concept summary","Eligible_Applicants":"Members of a Manitoba First Nation, aged 18 and over, eligible to work in Canada, with no ownership of a similar business in the past 12 months","Eligible_Criteria":"Submit an application describing the business, provide name and qualifications of proposed consultant, proposed terms of reference and a written proposal, including a quote","Description":"The program provides support to Manitoba First Nation individuals or enterprises with a business concept that requires financial assistance and professional business planning.","Summary":"The Manitoba First Nation Business Support program offers up to $20,000 in non-repayable funding to support the development of quality business plans for eligible applicants.","Grant_Goals":"To provide financial support and guidance to Manitoba First Nation individuals or enterprises in developing quality business plans.","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Sustainable Development Technology Canada","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Commercialization of innovative environmental and clean technology projects with strong end-user value proposition.","Eligible_Applicants":"Canadian companies with defined projects that demonstrate environmental and economic benefits for Canadians.","Eligible_Criteria":"Follow SDTC's How to Apply guide to check eligibility and complete the application process.","Description":"Sustainable Development Technology Canada provides funding for projects aimed at commercializing innovative environmental and clean technology solutions with economic and environmental benefits for Canadians.","Summary":"SDTC funding supports Canadian companies in commercializing environmentally beneficial technology projects with economic impacts.","Grant_Goals":"To advance and promote the adoption of clean technology solutions for environmental and economic benefits in Canada.","Eligible_Industries":["environment"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Atlantic Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up and expand, make the most of new technologies, improve productivity, create new products and find new markets","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations","Eligible_Criteria":"Contact the nearest ACOA office to discuss the project and complete the Application for financial assistance","Description":"The REGI program creates the right conditions to start and grow businesses in Atlantic Canada, helping them develop a strong, dynamic, and inclusive economy. It offers two options for funding: Business Scale-up and Productivity, and Regional Innovation Ecosystems.","Summary":"The Regional Economic Growth through Innovation (REGI) program supports businesses and non-profit organizations in Atlantic Canada to speed up their growth, develop regional networks, and innovate.","Grant_Goals":"To create the right conditions to start and grow businesses in Atlantic Canada","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments, Other technology development activities may be considered on a case-by-case basis.","Eligible_Applicants":"For profit organizations incorporated or partnership registered in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.","Eligible_Criteria":"For more information, consult the Program Guide.","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new products toward commercialization for novel, promising technologies, and an identified product/market fit.","Summary":"The Voucher Program provides Alberta tech companies with up to $100,000 to accelerate new product commercialization.","Grant_Goals":"To accelerate new products toward commercialization for novel, promising technologies, and an identified product/market fit.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development. Product testing and refinement. Patent development; (excluding patent maintenance fees). Advanced market assessment or segmentation analysis. Certifications. Advanced business and/or marketing strategies. Other technology development activities that will be considered on a case-by-case basis.","Eligible_Applicants":"Small to Medium Enterprise","Eligible_Criteria":"Coming Soon","Description":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Summary":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Grant_Goals":"To help Alberta tech companies design and/or develop innovative technological solutions.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Build a relationship with a strategic partner, validate product to a potential customer or market, have the first sale or increase sales revenue within 18 months post-project, expand supply or distribution channels, increase global competitiveness, provide strategic partner with access to innovative products, help strategic partner to de-risk exposure to new technology, expand products in strategic partners' distribution channels.","Eligible_Applicants":"Alberta tech companies with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.","Eligible_Criteria":"Full program and application details can be found in the Program Guide.","Description":"The Product Demonstration Program supports Alberta tech companies to commercialize their products and achieve optimal market position to increase revenue and expand into global markets.","Summary":"The Product Demonstration Program provides up to $150,000 for Alberta tech companies to enter a partnership with a strategic partner to conduct a product pilot or demonstration that proves their product’s technical and business merits.","Grant_Goals":"To help Alberta tech companies commercialize their products and achieve optimal market position to increase revenue and expand into global markets.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence (custom research, reports and studies), Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences, Visits to foreign markets, In-person participation at trade shows, networking functions, meetings or conferences, Participating in a trade mission","Eligible_Applicants":"Eligible Canadian small and medium-sized enterprises must be for-profit, be an incorporated legal entity, limited liability partnership (LLP) or cooperative, have an active Canada Revenue Agency business number, employ fewer than 500 full-time equivalent employees, have $100,000 to $100 million in declared revenue in Canada during its past fiscal year (or 12 months for quarterly filers)","Eligible_Criteria":"How to apply for CanExport SMEs - Applicant's guide","Description":"CanExport SMEs is a funding program that supports Canadian small and medium-sized enterprises in expanding internationally. The program funds activities such as gathering market intelligence, applying for intellectual property protection, seeking expert legal and business advice, and attending virtual trade shows and conferences. Eligible businesses must be for-profit, incorporated, have an active Canada Revenue Agency business number, employ fewer than 500 full-time equivalent employees, and have $100,000 to $100 million in declared revenue in Canada.","Summary":"CanExport SMEs is a program that helps Canadian small and medium-sized enterprises expand internationally by funding various non-travel activities such as market intelligence gathering, intellectual property protection, and virtual trade shows participation.","Grant_Goals":"To help Canadian small and medium-sized enterprises expand into global markets","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting and Mentoring","Amount":16250,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hiring consultants or mentors, hosting group learning activities","Eligible_Applicants":"Small or medium sized businesses, Universities, Community Colleges, Research institutions","Eligible_Criteria":"Applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Summary":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Grant_Goals":"To help Atlantic Canadian businesses and institutions in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business scale-up and productivity","Amount":0,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery and infrastructure, assessment, adaptation or adoption of new technologies or new production processes, activities aimed at boosting productivity and production or innovation capacity, commercialization and market development, implementation of commercialization strategies: participation in trade fairs, prospecting visits, hiring of marketing staff, ad campaigns, market diagnostics and studies, technology showcasing and demonstration, business management, hiring of resources to set up top-performing teams, adoption of best management practices, processes and systems, other activities may also be eligible.","Eligible_Applicants":"SMEs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, Indigenous organizations","Eligible_Criteria":"Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk","Description":"This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program.","Summary":"The funding provided under the REGI program aims to foster innovation and business growth at any stage of a business’s development, by funding projects that foster expansion, productivity and growth through innovation submitted by SMEs or NPOs.","Grant_Goals":"To foster innovation and business growth at any stage of a business’s development.","Eligible_Industries":["manufacturing","food processing","information, communications and multimedia technologies","life sciences"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Formal outbound trade events, international travel, promoting Alberta exports","Eligible_Applicants":"Alberta's small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations","Eligible_Criteria":"Apply for funding to offset travel-related costs as diversifying into new international markets. Contact program advisors for application discussion.","Description":"The Alberta Export Expansion Program (AEEP) supports export-ready companies and non-profit organizations to enhance access to international markets.","Summary":"The AEEP provides funding to help diversify into new international markets and attract global buyers.","Grant_Goals":"Enhancing international trade and promoting Alberta exports","Eligible_Industries":"all","Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of new, innovative technology that solves an industry problem in natural resources, engineering, or applied sciences","Eligible_Applicants":"Teams of academia and industry working on projects in the areas of natural resources and applied sciences","Eligible_Criteria":"The project must be a collaboration between a B.C. based industry and academic partner with the majority of the project work occurring in B.C. The project must have strong market potential and a strong research and commercialization plan aiming for commercialization within 3 years of the project start date. The project must secure matching funds from industry or government sources at a ratio of 2:1 matching dollars","Description":"The Ignite program provides funding for teams of academia and industry working on projects in the areas of natural resources and applied sciences to support the research and development of new, innovative technology","Summary":"The Ignite program offers up to $300,000 for research and development projects that solve industry problems in natural resources, engineering, or applied sciences","Grant_Goals":"To support the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences","Eligible_Industries":["natural resources","engineering","applied sciences"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Shipping technology to determine feasibility/compatibility with a partner's technology, Translating, adapting and creating promotional plans or materials, Attending virtual networking functions, meetings or conferences, Travel abroad or in Canada to meet with pre-identified foreign partners, Attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Familiarize yourself with the program details by reading our Applicant’s Guide. 2. Create an account on our online portal. 3. Note: Not compatible with Internet Explorer. 4. Once you are signed in, enter your information under My Profile and select Update. 5. On the CanExport Innovation landing page, select Apply Now!","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides funding for research and development (R&D) activities for innovative Canadian organizations.","Grant_Goals":"To increase international collaboration in research and development for innovative Canadian technologies.","Eligible_Industries":["technology"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"IDEaS","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Solving defence and security challenges, developing technology for defence and security purposes.","Eligible_Applicants":"Canadian innovators, technology developers, and researchers.","Eligible_Criteria":"Participating in IDEaS funding mechanisms such as Competitive Projects, Innovation Networks, Contests, Sandboxes, and Test Drives.","Description":"IDEaS is a program aimed at accelerating concepts and propelling solutions forward, building a defence innovation ecosystem.","Summary":"IDEaS provides funding mechanisms, including Competitive Projects, Innovation Networks, Contests, Sandboxes, and Test Drives, to assist Canadian innovators in solving defence and security challenges.","Grant_Goals":"To stimulate the free flow of ideas critical for innovations in defence and security.","Eligible_Industries":["technology","defence","security"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":300000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training and development programs for employees","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations, Metis Settlements, Agriculture Financial Services Corporation, Alberta Treasury Branches","Eligible_Criteria":"Applications must be submitted through the online portal. Employers must contribute a minimum of one-third of the total training costs for existing employees. Certified training providers are required.","Description":"The Canada-Alberta Job Grant is a training program where an employer applies on behalf of their present or future employees for eligible training costs.","Summary":"The Canada-Alberta Job Grant provides funding for employers to access training opportunities for their employees, with the government contributing two-thirds of the cost to a maximum of $10,000 per trainee per fiscal year.","Grant_Goals":"To increase access to training and development opportunities for employers and their employees in Alberta","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Participate in business workshops, seminars or networking events, talk to a mentor","Eligible_Applicants":"18 years of age or older, Ontario resident and Canadian citizen (or permanent resident)","Eligible_Criteria":"Apply through a Small Business Enterprise Centre, must be able to make a contribution in cash or in kind of at least 25% of the grant amount","Description":"If you’re starting, expanding or buying a small business, apply for training, mentoring and a grant through our Starter Company Plus program.","Summary":"Through Starter Company Plus, you can get one-on-one guidance, participate in business workshops, talk to a mentor, and apply for a grant of up to $5,000.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians, with an additional mandate for small business.","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services, development of a business plan or marketing plan","Eligible_Applicants":"First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, Native Alliance of Quebec","Eligible_Criteria":"Be a First Nation or the Native Alliance of Quebec, have necessary financial resources, present a viable business project, have good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, not involved in specific sectors of activity (gambling, sex, alcohol, tobacco)","Description":"The Aboriginal Business Financing Program (ABFP) provides non-refundable contributions of up to $99,999 for start-up, acquisition or expansion of a business, marketing activities, project management, professional services, and business/ marketing plan development. It is available to First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, and the Native Alliance of Quebec. Criteria include financial resources, viable business project, good credit rating, relevant experience and training, full-time business involvement, and exclusion from specific sectors.","Summary":"The Aboriginal Business Financing Program (ABFP) offers non-refundable contributions of up to $99,999 to support business start-up, expansion, marketing activities, and professional services for eligible First Nations and the Native Alliance of Quebec.","Grant_Goals":"To provide financial support for entrepreneurship and business development within the First Nations and Native Alliance of Quebec communities","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Provides training or professional development to Nunavummiut, leading to a new position, promotion, increased pay, or regular employment.","Eligible_Applicants":"Registered Nunavut-based employers with a position available for the trainee to advance into after training and can contribute at least one-third of the total eligible training expenses.","Eligible_Criteria":"For application forms or more information contact CareerDevelopment-TLMP@gov.nu.ca","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment. The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Summary":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, promotion, increased pay, or regular employment.","Grant_Goals":"To provide training or professional development to Nunavummiut, leading to a new position, promotion, increased pay, or regular employment.","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Management and marketing skills development","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Applicants must submit a detailed application including the purpose of the course, a course outline, and a detailed budget. Training must be through qualified trainers or organizations approved by the Fund.","Description":"Supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills.","Summary":"Supports rapid business readiness training for First Nations entrepreneurs to develop their management and marketing skills.","Grant_Goals":"To develop management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Manitoba First Nation Business Support Program","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business plan development, professional consultant services","Eligible_Applicants":"Manitoba First Nation individuals, First Nation-based enterprises","Eligible_Criteria":"Member of a Manitoba First Nation, aged 18 and over, eligible to work in Canada, not owned a similar business in the past 12 months","Description":"The program provides funding and support for Manitoba First Nation individuals or enterprises with a business concept that demonstrates a need for financial assistance, including engaging a professional consultant for business plan development.","Summary":"The Manitoba First Nation Business Support Program offers up to $20,000 non-repayable funding to support the development of quality business plans for eligible applicants.","Grant_Goals":"To provide financial assistance and support for Manitoba First Nation individuals or enterprises to develop quality business plans.","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Commercialization of innovative projects with strong end-user value proposition and demonstrated environmental and economic benefits for Canadians. Potential to attract a consortia partner to validate market need.","Eligible_Applicants":"Canadian companies with defined projects meeting the eligibility requirements.","Eligible_Criteria":"The application process, funding breakdown, obligations, and frequently asked questions are outlined on SDTC's website.","Description":"Sustainable Development Technology Canada (SDTC) provides funding to Canadian companies for innovative projects with environmental and economic benefits. The funding covers up to 40% of eligible project costs, with funds disbursed in five years or less.","Summary":"SDTC offers funding to Canadian companies for innovative projects with a strong end-user value proposition and demonstrated environmental and economic benefits. The average contribution ranges between $2 million and $4 million, covering up to 40% of eligible project costs.","Grant_Goals":"To support Canadian companies in commercializing innovative projects with environmental and economic benefits.","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Atlantic Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up, expand, make the most of new technologies, improve productivity, create new products, find new markets, support strategic clusters and groups, business accelerators, incubators, innovation-oriented organizations","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations, co-operatives, Indigenous-owned businesses, non-profit organizations, post-secondary educational institutions, angel networks, industry associations, consortiums, municipalities, community-owned Indigenous businesses","Eligible_Criteria":"Contact nearest ACOA office to discuss the project and then complete and submit the Application for financial assistance","Description":"The REGI program offers funding to help businesses and non-profit organizations develop a strong, dynamic, and inclusive economy in Atlantic Canada.","Summary":"The REGI program offers funding options for business scale-up and productivity as well as for regional innovation ecosystems, with a focus on creating strong and inclusive regional networks and providing support for under-represented groups.","Grant_Goals":"To create the right conditions to start and grow businesses in Atlantic Canada","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"Yes","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments, Other technology development activities","Eligible_Applicants":"For profit organization incorporated in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Consult the Program Guide for eligibility requirements.","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit.","Summary":"The Voucher Program provides up to $100,000 to help Alberta tech companies accelerate new product commercialization with novel, promising technologies.","Grant_Goals":"Accelerating new product commercialization for tech and innovation companies in Alberta.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":0,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development, product testing and refinement, patent development, advanced market assessment or segmentation analysis, certifications, advanced business and/or marketing strategies, other technology development activities","Eligible_Applicants":"Small to Medium Enterprise with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Access and submit application forms through SmartSimple, or connect with Technology Development Advisor. Complete list of eligibility requirements in Program Guide","Description":"The Micro Voucher Program provides non-dilutive funding up to $10,000 to help Alberta tech companies design and develop innovative technological solutions.","Summary":"The Micro Voucher Program offers up to $10,000 for qualified activities including technology development, testing, and market assessment, with continuous intake.","Grant_Goals":"To help Alberta tech companies design and develop innovative technological solutions","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"To commercialize products and achieve optimal market position, entering a partnership with a strategic partner to conduct a product pilot or demonstration.","Eligible_Applicants":"Alberta tech companies with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue looking to commercialize their products.","Eligible_Criteria":"Details can be found in the Program Guide.","Description":"The Product Demonstration Program supports Alberta tech companies in commercializing their products and achieving optimal market position to increase revenue and expand into global markets.","Summary":"The Product Demonstration Program offers up to $150,000 to Alberta tech companies to enter partnerships with strategic partners for product pilots or demonstrations aimed at proving technical and business merits, and achieving global competitiveness.","Grant_Goals":"To assist Alberta tech companies in commercializing their products and achieving optimal market position.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence, applying for intellectual property protection in international markets, applying for certification in international markets, seeking expert legal and business advice, search engine optimization, translating, adapting or creating marketing materials, attending virtual trade shows, networking functions, meetings or conferences","Eligible_Applicants":"Incorporated Canadian for-profit businesses <500 full-time payroll employees and between $100,000-$100M in Canadian annual revenue","Eligible_Criteria":"Please visit the program's official page for application details","Description":"The CanExport SMEs funding program supports non-travel activities that help Canadian small and medium-sized enterprises expand internationally. It provides financial assistance for a range of eligible activities such as gathering market intelligence, applying for intellectual property protection, and attending virtual trade shows.","Summary":"CanExport SMEs provides funding for non-travel activities to help Canadian SMEs expand internationally.","Grant_Goals":"To support Canadian SMEs in expanding into global markets","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting & Mentoring","Amount":16250,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hire consultants or mentors to help get a new and innovative product, technology, or process to market. Host group learning activities that will improve knowledge and preparedness for commercialization.","Eligible_Applicants":"Small or medium sized business, University or Community College, Research institution (excluding Federal labs)","Eligible_Criteria":"Eligible applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Summary":"The Commercialization Consulting and Mentoring Program (CCM) provides up to $16,250 (65% of project costs) to help businesses and institutions in Atlantic Canada in the final stages of commercialization.","Grant_Goals":"To help businesses and institutions in Atlantic Canada in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"REGI Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery and infrastructure, Assessment, adaptation or adoption of new technologies or new production processes, Activities aimed at boosting productivity and production or innovation capacity, Commercialization and market development, Implementation of commercialization strategies, Participation in trade fairs, Prospecting visits, Hiring of marketing staff, Ad campaigns, Market diagnostics and studies, Technology showcasing and demonstration, Business management, Hiring of resources to set up top-performing teams, Adoption of best management practices, processes and systems, Other activities may also be eligible. Contact us to discuss your project.","Eligible_Applicants":"SMEs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, Indigenous organizations","Eligible_Criteria":"Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk","Description":"This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program.","Summary":"This funding aims to foster innovation and business growth, and can be awarded at any stage of a business’s development. It is provided under the REGI program.","Grant_Goals":"Foster innovation and business growth","Eligible_Industries":["manufacturing","food processing","information, communications and multimedia technologies","life sciences"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International travel to formal outbound trade events","Eligible_Applicants":"Alberta companies and non-profits","Eligible_Criteria":"Coming Soon","Description":"Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Summary":"Supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations that promote Alberta exports through international travel to formal outbound trade events.","Grant_Goals":"Enhancing international trade","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of new, innovative technology in natural resources, engineering or applied sciences","Eligible_Applicants":"Academia and industry teams working on projects in natural resources and applied sciences","Eligible_Criteria":"The project must meet specific eligibility criteria regarding collaboration, technology readiness level, market potential, research and commercialization plan, and matching funds","Description":"The Ignite program provides funding of up to $300,000 to support the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences. The program aims to facilitate collaboration between academia and industry partners in British Columbia and accelerate the commercialization of innovations.","Summary":"The Ignite program offers funding to support academia and industry teams in British Columbia working on projects in natural resources and applied sciences, with the goal of commercializing new, innovative technology.","Grant_Goals":"To support the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences, and accelerate their commercialization","Eligible_Industries":["natural resources","engineering","applied sciences"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, applying for certification in international markets, seeking expert legal and business advice, shipping technology to determine feasibility/compatibility with a partner's technology, translating, adapting, and creating promotional plans or materials, attending virtual networking functions, meetings or conferences, travel abroad or in Canada to meet with pre-identified foreign partners, attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Familiarize yourself with the program details by reading our Applicant’s Guide. 2. Create an account on our online portal. 3. Note: Not compatible with Internet Explorer. 4. Once you are signed in, enter your information under My Profile and select Update. 5. On the CanExport Innovation landing page, select Apply Now!","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. Funding covers up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides funding for non-travel and travel-related activities to support research and development for Canadian small and medium-sized enterprises, academic institutions, and non-government research centres.","Grant_Goals":"To support research and development for Canadian organizations and promote international collaboration in R&D","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"IDEaS Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Competitive Projects, Innovation Networks, Contests, Sandboxes, Test Drives","Eligible_Applicants":"Canadian innovators","Eligible_Criteria":"Join the mailing list for new Calls for Proposals and ongoing updates","Description":"IDEaS is an innovation program aimed at solving defence and security challenges by providing funding mechanisms and opportunities for Canadian innovators.","Summary":"IDEaS provides funding mechanisms such as Competitive Projects, Innovation Networks, Contests, Sandboxes, and Test Drives to assist Canadian innovators in solving defence and security challenges.","Grant_Goals":"To accelerate concepts and propel solutions forward, building a defence innovation ecosystem.","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":15000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training for employees, specified instructional materials, and eligible travel costs","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations and Metis Settlements, the Agriculture Financial Services Corporation, Alberta Treasury Branches","Eligible_Criteria":"Applications must be submitted through the online portal. Training must meet certain requirements and be completed within specified timeframes. Payment processes and contact information are detailed in the provided documentation.","Description":"The Canada-Alberta Job Grant provides funding for employers to help employees and unemployed Albertans access training opportunities. Employers must contribute a minimum of one-third of the total training costs for existing employees. The Government contributes two-thirds of the cost to a maximum of $10,000 per trainee per fiscal year. If hiring and training an unemployed Albertan, up to 100% of training costs could be covered, up to $15,000 per trainee.","Summary":"The Canada-Alberta Job Grant offers financial support to help employers provide training for their employees and potential future employees. It aims to contribute to the development of a skilled workforce in Alberta.","Grant_Goals":"To support employers in providing training for their employees and unemployed individuals to improve skills and contribute to Alberta's workforce development","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"One-on-one guidance, business workshops, seminars, networking events, mentoring","Eligible_Applicants":"18 years of age or older, Ontario resident and Canadian citizen (or permanent resident), not attending school full-time or returning to school","Eligible_Criteria":"Apply through a Small Business Enterprise Centre. Must be able to make a contribution of at least 25% of the grant amount.","Description":"Starter Company Plus provides training, mentoring, and a grant of up to $5,000 for starting, expanding, or buying a small business in Ontario.","Summary":"Starter Company Plus offers one-on-one guidance, workshops, mentoring, and a grant of up to $5,000 for Ontario residents starting or expanding a small business.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians, with an additional mandate for small business.","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, development of a business plan, marketing plan or feasibilities studies","Eligible_Applicants":"FIRST NATIONS, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC","Eligible_Criteria":"Be a First Nation or the Native Alliance of Quebec or a member of a First Nation or the Native Alliance of Quebec or a corporation owned by a First Nation, the Native Alliance of Quebec or by one of their members. Have the necessary financial resources, present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, not operate a business involved in gambling, sex, alcohol, tobacco","Description":"The Aboriginal Business Financing Program (ABFP) provides non-refundable contributions for start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, and development of a business plan, marketing plan or feasibilities studies for First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, and the NATIVE ALLIANCE OF QUEBEC.","Summary":"The Aboriginal Business Financing Program (ABFP) offers non-refundable contributions of up to $99,999 for eligible First Nations and organizations in Quebec to support business development and growth projects.","Grant_Goals":"To provide financial support for eligible First Nations and organizations in developing viable business projects and fostering economic growth within the community","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training or professional development for Nunavummiut","Eligible_Applicants":"Registered Nunavut-based employers","Eligible_Criteria":"Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment. The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Summary":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Grant_Goals":"Encourages employers to provide training or professional development to Nunavummiut","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"First Nations Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business management and marketing skills training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Submission of application including purpose of the course, course outline, and detailed budget; Approach other First Nation educational funding agencies; Training through qualified trainers or approved organizations specific to business management","Description":"Supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills.","Summary":"Supports training for First Nations entrepreneurs to develop management and marketing skills.","Grant_Goals":"Supporting the development of management and marketing skills for First Nations entrepreneurs","Eligible_Industries":[],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Manitoba First Nation Business Plan Support","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of a quality business plan","Eligible_Applicants":"Manitoba First Nation members 18 and over with a business concept","Eligible_Criteria":"Submit an application, not have owned a similar business in the past 12 months, provide qualifications of the proposed consultant and a written proposal with a quote","Description":"The program provides financial support to Manitoba First Nation individuals or enterprises to develop a quality business plan and attract financing.","Summary":"This program supports Manitoba First Nation individuals in developing quality business plans through financial assistance and professional consultancy services.","Grant_Goals":"To provide support to Manitoba First Nation individuals or enterprises in developing quality business plans.","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Not specified","Eligible_Applicants":"Canadian companies with a defined project and demonstrated environmental and economic benefits for Canadians","Eligible_Criteria":"Not specified","Description":"SDTC provides funding for Canadian companies with a strong end-user value proposition and the potential to attract a consortia partner to validate the market need. The funding covers up to 40% of eligible project costs, with contributions between $2 million and $4 million disbursed in five years or less.","Summary":"SDTC Funding provides up to 40% of eligible project costs with contributions between $2 million and $4 million disbursed in five years or less.","Grant_Goals":"To support emerging companies in becoming the next market leaders in sustainability","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Coming Soon","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Coming Soon","Eligible_Applicants":"Coming Soon","Eligible_Criteria":"Coming Soon","Description":"Coming Soon","Summary":"Coming Soon","Grant_Goals":"Coming Soon","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments, Other technology development activities may be considered on a case-by-case basis.","Eligible_Applicants":"You have fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue. You are a for-profit organization that is incorporated, or a partnership registered in Alberta. You can contribute a minimum of 25 per cent cash contribution of the total eligible project costs. You have a new, unique technology or innovation that is patentable working toward commercialization.","Eligible_Criteria":"For more information, consult the Program Guide. SmartSimple Online Application Portal, Standard Investment Agreement Template, Financial Documents Resource – Voucher Program, Technology Development Advisors, Connectica, Regional Innovation Network.","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit.","Summary":"The Voucher Program provides Alberta tech companies with up to $100,000 to accelerate new product commercialization.","Grant_Goals":"To accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"Yes","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development. Product testing and refinement. Patent development; (excluding patent maintenance fees). Advanced market assessment or segmentation analysis. Certifications. Advanced business and/or marketing strategies. Other technology development activities that will be considered on a case-by-case basis.","Eligible_Applicants":"Small to Medium Enterprise in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue, and novel technology with an opportunity for intellectual property.","Eligible_Criteria":"Access and submit application forms through the SmartSimple online application portal or connect with the Technology Development Advisor. All applications are reviewed and evaluated to determine fit with the Micro Voucher Program objectives and intended outcomes.","Description":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Summary":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and/or develop innovative technological solutions.","Grant_Goals":"To help Alberta tech companies design and/or develop innovative technological solutions.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Build a relationship with a strategic partner to leverage their industry knowledge and distribution channels. Validate your product to a potential customer or market. Have your first sale or increase sales revenue within 18 months post project; Expand your supply or distribution channels. Increase your global competitiveness. Provide your strategic partner with access to innovative products to solve operational challenges for itself or its customers. Help your strategic partner to de-risk exposure to new technology. Expand products in strategic partners’ distribution channels.","Eligible_Applicants":"Alberta-based tech companies with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.","Eligible_Criteria":"Full program and application details can be found in the Program Guide.","Description":"The Product Demonstration Program supports Alberta tech companies commercialize their products and achieve optimal market position to increase revenue and expand into global markets.","Summary":"The Product Demonstration Program provides up to $150,000 to Alberta tech companies wanting to commercialize their products and achieve optimal market position.","Grant_Goals":"To support Alberta tech companies in commercializing their products and achieving optimal market position.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence (custom research, reports and studies), Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences, Visits to foreign markets, In-person participation at trade shows, networking functions, meetings or conferences, Participating in a trade mission","Eligible_Applicants":"Eligible Canadian small and medium-sized enterprises must: be for-profit, be an incorporated legal entity, limited liability partnership (LLP) or cooperative, have an active Canada Revenue Agency business number, employ fewer than 500 full-time equivalent employees, have $100,000 to $100 million in declared revenue in Canada during its past fiscal year (or 12 months for quarterly filers)","Eligible_Criteria":"Please visit the Applicant's guide available on the program website for detailed information on how to apply.","Description":"CanExport SMEs is a funding program that helps Canadian small and medium-sized enterprises with for-profit business models to expand internationally. It supports various non-travel activities such as gathering market intelligence, applying for intellectual property protection, seeking expert legal and business advice, and more.","Summary":"CanExport SMEs provides financial assistance to eligible Canadian small and medium-sized enterprises to engage in non-travel activities that aim to expand their businesses internationally.","Grant_Goals":"To assist Canadian small and medium-sized enterprises in expanding into global markets.","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting & Mentoring","Amount":16250,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hire consultants or mentors, host group learning activities","Eligible_Applicants":"Small or medium sized businesses, Universities, Community Colleges, Research institutions","Eligible_Criteria":"CCM is open to all industry sectors, except retail/wholesale, real estate, government services, personal or social services and softwood lumber. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible. Each eligible application will be subject to an evaluation process. A maximum of two projects is allowed per technology. Activities in a second project must demonstrate a progressive, incremental activity.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization. The program is managed by LearnSphere, with financial assistance from the Atlantic Canada Opportunities Agency.","Summary":"The Commercialization Consulting and Mentoring Program provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Grant_Goals":"To help Atlantic Canadian businesses and institutions in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"REGI Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery, Assessment, adaptation or adoption of new technologies, Activities aimed at boosting productivity and production or innovation capacity, Commercialization and market development, Implementation of commercialization strategies, Participation in trade fairs, Prospecting visits, Hiring of marketing staff, Ad campaigns, Market diagnostics and studies, Technology showcasing and demonstration, Business management, Adoption of best management practices, processes and systems, Other activities may also be eligible","Eligible_Applicants":"SMEs, NPOs, Co-ops, Business associations, Business support organizations, Indigenous organizations","Eligible_Criteria":"Refer to the Project Submission Guide. For more information, contact us.","Description":"This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation.","Summary":"This funding under the REGI program aims to foster innovation and business growth by funding projects submitted by SMEs or NPOs.","Grant_Goals":"To foster innovation and business growth","Eligible_Industries":["manufacturing","food processing","information, communications and multimedia technologies","life sciences","all"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International travel to formal outbound trade events","Eligible_Applicants":"Alberta companies and non-profits","Eligible_Criteria":"Coming Soon","Description":"Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Summary":"The Alberta Export Expansion Program (AEEP) supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, and economic development organizations that promote Alberta exports through international travel to formal outbound trade events.","Grant_Goals":"Enhancing international trade","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of new, innovative technology in natural resources and applied sciences","Eligible_Applicants":"Teams of academia and industry working on projects in natural resources and applied sciences","Eligible_Criteria":"The project must support the research and development of a new, innovative technology that solves an industry problem in natural resources, engineering, or applied sciences. It must be a collaboration between a B.C. based industry and academic partner, with a majority of the project work occurring in B.C. The project partners must agree regarding IP ownership. The innovation must be at a minimum of Technology Readiness Level (TRL) of 3, with strong market potential and a strong research and commercialization plan aiming to achieve commercialization within 3 years of the project start date. The project must secure matching funds from industry or government sources at a 2:1 ratio.","Description":"The grant aims to support the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences, with a focus on market potential and commercialization.","Summary":"The Ignite grant provides up to $300,000 to support teams of academia and industry working on projects in natural resources and applied sciences, with a strong focus on market potential and commercialization.","Grant_Goals":"To support the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences.","Eligible_Industries":["all"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Shipping technology to determine feasibility/compatibility with a partner's technology, Translating, adapting and creating promotional plans or materials, Attending virtual networking functions, meetings or conferences, Travel abroad or in Canada to meet with pre-identified foreign partners, Attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Read the Applicant's Guide. 2. Have a Canada Revenue Agency (CRA) business number. 3. Own, co-own, or have decision-making authority over the intellectual property (IP) rights for the technology. 4. Have a prototype (Technology Readiness Level 4 or higher). 5. Intend to commercially launch the technology within 5 years.","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides funding for research and development (R&D) activities to assist Canadian organizations in pursuing collaborative R&D agreements with international partners.","Grant_Goals":"To support research and development (R&D) activities for Canadian organizations seeking to collaborate with international partners","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"IDEaS","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Solving defence and security challenges, technology development, innovation stimulation","Eligible_Applicants":"Canadian innovators","Eligible_Criteria":"Details on how to participate can be found on the IDEaS website.","Description":"IDEaS is more than just a funding program. It accelerates concepts and propels solutions forward, building a defence innovation ecosystem.","Summary":"IDEaS provides funding mechanisms to assist Canadian innovators in solving defence and security challenges.","Grant_Goals":"To accelerate concepts and propel solutions forward, building a defence innovation ecosystem","Eligible_Industries":["technology","security","innovation"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":15000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Eligible employers can get government funding to help employees and unemployed Albertans access training opportunities.","Eligible_Applicants":"To be eligible, employers must have current or potential employees who need training to fill current or future positions.","Eligible_Criteria":"Trainees must be employees (current or prospective) and one of the following: Canadian citizens, permanent residents, protected people under the Immigration and Refugee Protection Act (Canada) who are entitled to work in Canada, business owners (incorporated, unincorporated, sole-proprietor, partnerships) with 4 or fewer employees, including all owners, are now eligible trainees, family members employed with the applicant company for more than 3 months. The employer applicant cannot be the training provider.","Description":"The Canada-Alberta Job Grant is a training program where eligible employers can get government funding to help employees and unemployed Albertans access training opportunities. Employers decide who gets training and what type of training may be needed for their employees.","Summary":"The Canada-Alberta Job Grant provides funding for employers to train current and future employees, with the government contributing up to two-thirds of the training costs to a maximum of $15,000 per trainee per fiscal year.","Grant_Goals":"N/A","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Participate in business workshops, seminars or networking events, talk to a mentor with experience","Eligible_Applicants":"18 years of age or older, Ontario resident and Canadian citizen (or permanent resident)","Eligible_Criteria":"Apply through a Small Business Enterprise Centre","Description":"Get training, mentoring, and a grant of up to $5,000 for starting, expanding, or buying a small business in Ontario.","Summary":"Starter Company Plus offers guidance, workshops, mentoring, and up to $5,000 in funding for new or expanding businesses in Ontario.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, Implementation of marketing activities, Project-related management, Professional advisory services after the business is launched","Eligible_Applicants":"FIRST NATIONS, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC","Eligible_Criteria":"Be: – A First Nation or the Native Alliance of Quebec – A member of a First Nation or the Native Alliance of Quebec – A corporation owned by a First Nation, the Native Alliance of Quebec or by one of their members Have the necessary financial resources (equity: 10% minimum of the cost of the project) Present a viable business project Have a good credit rating Have experience and training in the field of activities Mandatory full-time involvement in the business Operate a business not involved in the following sectors of activity (gambling, sex, alcohol, tobacco)","Description":"The Aboriginal Business Financing Program (ABFP) provides non-refundable contributions for the start-up, acquisition, or expansion of businesses, implementation of marketing activities, project-related management, and professional advisory services for First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC.","Summary":"The Aboriginal Business Financing Program (ABFP) offers non-refundable contributions for eligible First Nations and Native Alliance of Quebec for business start-up, expansion, marketing activities, and project-related management.","Grant_Goals":"Supporting the economic development of First Nations and the Native Alliance of Quebec.","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training or professional development for Nunavummiut leading to new positions, promotions, increased pay, or regular employment","Eligible_Applicants":"Registered Nunavut-based employers with available positions for trainees to advance into after training and can contribute at least one-third of the total eligible training expenses","Eligible_Criteria":"Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment. The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Summary":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment. The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Grant_Goals":"Encourages employers to provide training or professional development to Nunavummiut, leading to new positions, promotions, increased pay, or regular employment","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Rapid Business Readiness Training","Amount":0,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Management and marketing skills training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Applicants must submit application, approach other funding agencies, and receive training from approved organizations.","Description":"The program supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills.","Summary":"This program supports rapid business readiness training for new and existing First Nations entrepreneurs.","Grant_Goals":"To develop management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Manitoba First Nation Business Support Program","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business concept development, business plan creation","Eligible_Applicants":"Members of a Manitoba First Nation, aged 18 and over, eligible to work in Canada","Eligible_Criteria":"Approval of funding required prior to consultant commencing the assignment","Description":"This program provides support to Manitoba First Nation individuals or enterprises with a business concept that demonstrates a need for financial assistance. It allows the engagement of a professional consultant to develop a business plan.","Summary":"The Manitoba First Nation Business Support Program offers non-repayable funding up to $20,000 for developing a quality business plan.","Grant_Goals":"To support Manitoba First Nation individuals or enterprises with promising business concepts","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business expansion or new product development with strong environmental and economic benefits for Canadians.","Eligible_Applicants":"Canadian companies with a defined project and potential to attract a consortia partner.","Eligible_Criteria":"Check the 'How to apply - download here' button to learn more about the application process.","Description":"Sustainable Development Technology Canada (SDTC) provides funding for Canadian companies with innovative projects that demonstrate environmental and economic benefits for Canadians.","Summary":"SDTC funding ranges from 33% to 40% of eligible project costs, with an average contribution between $2 million and $4 million disbursed in five years or less.","Grant_Goals":"To support the development and commercialization of sustainable technologies in Canada.","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up, expand, make the most of new technologies, improve productivity, create new products, find new markets, support businesses at each stage of development, make business support networks stronger for under-represented groups","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations","Eligible_Criteria":"Contact the nearest ACOA office to discuss the project and complete and submit the Application for financial assistance.","Description":"The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada. Through REGI, the Atlantic Canada Opportunities Agency (ACOA) is helping businesses and non-profit organizations develop a strong, dynamic and inclusive economy.","Summary":"The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada.","Grant_Goals":"Create strong and inclusive regional networks to fuel growth and innovation.","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"Yes","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, leading-edge design, engineering and prototype development, advanced product testing and refinement, patent development, advanced market assessments","Eligible_Applicants":"For profit organization incorporated or partnership registered in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Connect with Alberta Innovates for application details. All applications are reviewed and evaluated to determine fit with the Voucher Program objectives and intended outcomes","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit.","Summary":"The Voucher Program provides up to $100,000 to help Alberta tech companies accelerate new product commercialization for novel, promising technologies.","Grant_Goals":"To accelerate new product commercialization for novel, promising technologies","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, prototype development, product testing, refinement, patent development, advanced market assessment, certifications, advanced business and marketing strategies, other technology development activities","Eligible_Applicants":"Small to Medium Enterprise with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Follow the program guide for eligibility requirements. Apply through the SmartSimple online portal or connect with Technology Development Advisor.","Description":"The Micro Voucher Program provides up to $10,000 in non-dilutive funding to help Alberta tech companies design and/or develop innovative technological solutions.","Summary":"The Micro Voucher Program offers non-dilutive funding of up to $10,000 to assist Alberta tech companies in designing and developing innovative technological solutions.","Grant_Goals":"To support Alberta tech companies in designing and developing innovative technological solutions.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Product pilot or demonstration, building relationship with strategic partner, validating product to potential customer, expanding supply or distribution channels, increasing global competitiveness","Eligible_Applicants":"Alberta-based tech companies with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue, looking to enter a partnership with a strategic partner to conduct a product pilot or demonstration","Eligible_Criteria":"Full program and application details can be found in the Program Guide.","Description":"The Product Demonstration Program provides support for Alberta tech companies to commercialize their products and achieve optimal market position, with funding of up to $150,000 to enter a partnership with a strategic partner to conduct a product pilot or demonstration.","Summary":"The Product Demonstration Program offers funding to Alberta tech companies seeking to commercialize their products and achieve optimal market position, supporting partnerships with strategic partners and validating products to potential customers.","Grant_Goals":"To help Alberta tech companies commercialize their products, increase revenue, and expand into global markets.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence, Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, attending conferences, Visits to foreign markets","Eligible_Applicants":"Incorporated Canadian for-profit businesses <500 full-time payroll employees and between $100,000-$100M in Canadian annual revenue.","Eligible_Criteria":"Please visit the Applicant's Guide for details.","Description":"CanExport SMEs is a funding program that supports Canadian small and medium-sized enterprises to expand internationally through various non-travel and travel-related activities. It aims to help businesses gather market intelligence, protect their intellectual property, seek legal and business advice, and participate in international trade events and missions.","Summary":"CanExport SMEs helps Canadian SMEs expand into global markets by providing funding for non-travel and travel-related activities, including market intelligence gathering, IP protection, and international trade event participation.","Grant_Goals":"To assist Canadian small and medium-sized enterprises in expanding into global markets.","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting and Mentoring","Amount":16250,"Deadline":"Closed","Eligible_Region":"New Brunswick","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hiring consultants or mentors, hosting group learning activities","Eligible_Applicants":"Small or medium sized businesses, University or Community College, Research institution (excluding Federal labs)","Eligible_Criteria":"Eligible applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Summary":"The Commercialization Consulting and Mentoring Program provides up to $16,250 to assist Atlantic Canadian businesses and institutions in the final stages of commercialization.","Grant_Goals":"To assist Atlantic Canadian businesses and institutions in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business scale-up and productivity","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery, assessment, adaptation or adoption of new technologies or new production processes, activities aimed at boosting productivity and production or innovation capacity, commercialization and market development, implementation of commercialization strategies, participation in trade fairs, prospecting visits, hiring of marketing staff, ad campaigns, market diagnostics and studies, technology showcasing and demonstration, business management, hiring of resources to set up top-performing teams, adoption of best management practices, processes and systems, and other eligible activities.","Eligible_Applicants":"SMEs, Co-ops, Business associations, Non-profit organizations (NPOs), Business support organizations, and Indigenous organizations in economically vulnerable RCM or in Montréal’s East End","Eligible_Criteria":"Projects are analyzed against specific criteria, namely the expected results of the project, the viability of the business or organization, the technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, and the degree of risk.","Description":"This funding aims to foster innovation and business growth, and can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity, and growth through innovation. This funding is provided under the REGI program.","Summary":"This funding supports projects in various sectors including manufacturing, food processing, information, communications and multimedia technologies, life sciences, and other eligible sectors.","Grant_Goals":"To foster innovation and business growth through the support of projects in eligible sectors.","Eligible_Industries":["manufacturing","food processing","information","communications and multimedia technologies","life sciences","all"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International travel to formal outbound trade events","Eligible_Applicants":"Alberta companies and non-profits","Eligible_Criteria":"Coming Soon","Description":"Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Summary":"The Alberta Export Expansion Program supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations that promote Alberta exports through international travel to formal outbound trade events.","Grant_Goals":"Enhancing international trade","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of innovative technology in natural resources, engineering, or applied sciences","Eligible_Applicants":"Teams of academia and industry working on projects in the areas of natural resources and applied sciences","Eligible_Criteria":"Follow the program guidelines and secure matching funds from industry or government sources at a ratio of 2:1 matching dollars.","Description":"The Ignite program supports the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences, with strong market potential and a plan for achieving commercialization.","Summary":"The program provides funding of up to $300,000 for teams of academia and industry working on research and development projects in natural resources and applied sciences.","Grant_Goals":"To support the research and development of innovative technology with strong market potential and plans for achieving commercialization in British Columbia","Eligible_Industries":["natural resources","engineering","applied sciences"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Shipping technology to determine feasibility/compatibility with a partner's technology, Translating, adapting and creating promotional plans or materials, Attending virtual networking functions, meetings or conferences, Travel abroad or in Canada to meet with pre-identified foreign partners, Attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Read the Applicant's Guide. 2. Check the Frequently asked questions. 3. Ensure you meet all the eligibility requirements. 4. Complete the application form. 5. Submit the application form.","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides funding of up to $75,000 to assist Canadian organizations with research and development for a single technology, covering up to 75% of the costs of collaborative R&D agreements with international partners.","Grant_Goals":"To support research and development (R&D) for a single technology","Eligible_Industries":["technology"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"IDEaS","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Competitive Projects, Innovation Networks, Contests, Sandboxes, Test Drives","Eligible_Applicants":"Canadian innovators","Eligible_Criteria":"Join the mailing list to receive updates on Calls for Proposals.","Description":"The IDEaS program provides funding mechanisms to assist Canadian innovators in solving defence and security challenges.","Summary":"IDEaS provides funding mechanisms to assist Canadian innovators in solving defence and security challenges.","Grant_Goals":"To accelerate concepts and propel solutions forward, building a defence innovation ecosystem.","Eligible_Industries":["technology"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":15000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training and development of current or potential employees","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations, Metis Settlements, Agriculture Financial Services Corporation, Alberta Treasury Branches","Eligible_Criteria":"Refer to the Canada-Alberta Job Grant Applicant Guide","Description":"The Canada-Alberta Job Grant provides funding for employers to support training and development for current or potential employees. Employers contribute one-third of the total training costs, and the government contributes two-thirds of the cost to a maximum of $10,000 per trainee per fiscal year. For unemployed Albertans, up to 100% of training costs could be covered, up to $15,000 per trainee. The maximum amount per employer is $300,000 per fiscal year.","Summary":"The Canada-Alberta Job Grant is a training program that helps employers provide training and development opportunities for their employees. Employers contribute a portion of the training costs, and the government provides funding to support the remaining costs, up to a maximum of $15,000 per trainee for unemployed Albertans.","Grant_Goals":"To support employers in providing training and development opportunities for their current or potential employees","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"participate in business workshops, seminars or networking events, talk to a mentor with experience in starting, expanding or buying a small business","Eligible_Applicants":"an Ontario resident and Canadian citizen (or permanent resident) not attending school full-time or returning to school","Eligible_Criteria":"You apply through a Small Business Enterprise Centre.","Description":"If you’re starting, expanding or buying a small business, apply for training, mentoring and a grant through our Starter Company Plus program.","Summary":"Through Starter Company Plus, you can get one-on-one guidance, participate in business workshops, seminars or networking events, and talk to a mentor. You can also apply for a grant of up to $5,000.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, implementation of marketing activities, project-related management, professional advisory services after the business is launched, development of a business plan, marketing plan or feasibilities studies","Eligible_Applicants":"First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, Native Alliance of Quebec","Eligible_Criteria":"Be a First Nation or the Native Alliance of Quebec, have necessary financial resources, present a viable business project, have a good credit rating, have experience and training in the field of activities, mandatory full-time involvement in the business, operate a business not involved in certain sectors of activity","Description":"The Aboriginal Business Financing Program (ABFP) is a non-refundable contribution program aimed at supporting First Nations, the Native Alliance of Quebec, or businesses owned by them with financing for start-up, acquisition, expansion, marketing activities, and professional advisory services. The program evaluates the financial resources, credit rating, business project viability, and experience and training in the field of activities for eligibility.","Summary":"The ABFP provides up to $99,999 non-refundable contribution for eligible activities such as start-up, acquisition, expansion, marketing activities, and professional advisory services to support First Nations and businesses owned by them in Quebec.","Grant_Goals":"To provide financial support for start-up, acquisition, expansion, marketing activities, and professional advisory services for First Nations and businesses owned by them in Quebec.","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Providing training or professional development to Nunavummiut leading to a new position, a promotion, increased pay within the organization, or regular employment.","Eligible_Applicants":"Registered Nunavut-based employers with a position available for the trainee to advance into after training, and able to contribute at least one-third of the total eligible training expenses.","Eligible_Criteria":"Contact Career Development for application forms or more information.","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Summary":"The Grant for Nunavut Employers covers two-thirds of the eligible costs for each trainee, subject to availability, in the form of a reimbursement to the employer based on the successful completion of training.","Grant_Goals":"To encourage employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"First Nations Business Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business management training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Applicants must have a detailed budget and course outline; must have approached other First Nation educational funding agencies prior to applying; training must be specific to business management.","Description":"The program provides funding for rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills. Living expenses are not included, and the program is not intended to finance the acquisition of a degree or certificate.","Summary":"The First Nations Business Training program supports rapid business readiness training for First Nations entrepreneurs to develop their management and marketing skills, covering up to 75% of approved course costs.","Grant_Goals":"To develop management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"First Nations Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business management and marketing training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Submission of purpose of the course, course outline, detailed budget. The applicant should have approached other First Nation educational funding agencies prior to applying to the Fund. Training must be through qualified trainers or organizations approved by the Fund.","Description":"Supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills. Funding covers up to 75% of approved course costs, excluding living expenses.","Summary":"Provides funding for business readiness training for First Nations entrepreneurs, covering up to 75% of course costs.","Grant_Goals":"To develop the management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business expansion, new product development, environmental and economic benefit projects","Eligible_Applicants":"Canadian companies with defined projects and strong end-user value propositions","Eligible_Criteria":"Please check the official SDTC website for information on how to apply and eligibility criteria.","Description":"Sustainable Development Technology Canada (SDTC) provides funding for Canadian companies with innovative projects that have the potential for environmental and economic benefits. The average contribution is between $2 million and $4 million, and at least 50% of eligible project costs must be incurred in Canada.","Summary":"SDTC provides funding of up to 40% of eligible project costs for Canadian companies with innovative projects that demonstrate environmental and economic benefits. The funding is aimed at accelerating the deployment of clean technologies.","Grant_Goals":"To support the development and commercialization of clean technologies that benefit the environment and economy.","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Atlantic Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up and expand, make the most of new technologies, improve productivity, create new products and find new markets","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, non-profit organizations","Eligible_Criteria":"Contact nearest ACOA office to discuss project and then complete and submit the Application for financial assistance.","Description":"The Regional Economic Growth through Innovation (REGI) program creates the right conditions to start and grow businesses in Atlantic Canada. It helps businesses and non-profit organizations develop a strong, dynamic and inclusive economy.","Summary":"The REGI program offers two funding options: Business Scale-up and Productivity, and Regional Innovation Ecosystems. It aims to speed up business growth, support non-profit organizations, and create strong regional networks to fuel growth and innovation.","Grant_Goals":"Create strong regional networks to fuel growth and innovation","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI)","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up and expand, make the most of new technologies, improve productivity, create new products and find new markets, support businesses at each stage of development, strengthen business support networks for under-represented groups","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations or co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations","Eligible_Criteria":"Contact your nearest ACOA office to discuss your project and then complete and submit the Application for financial assistance.","Description":"The REGI program creates the right conditions to start and grow businesses in Atlantic Canada by helping businesses and non-profit organizations develop a strong, dynamic and inclusive economy. It offers two funding options: Business Scale-up and Productivity, and Regional Innovation Ecosystems.","Summary":"The REGI program aims to speed up the growth of businesses, support businesses at each stage of development, and create strong and inclusive regional networks to fuel growth and innovation.","Grant_Goals":"To create the right conditions to start and grow businesses in Atlantic Canada, and to support strong and inclusive regional networks to fuel growth and innovation","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development; product testing and refinement; patent development; advanced market assessment; certifications; advanced business and marketing strategies; other technology development activities","Eligible_Applicants":"Small to Medium Enterprise tech companies in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Check the Program Guide for complete eligibility requirements.","Description":"The Micro Voucher Program helps Alberta tech companies design and/or develop innovative technological solutions by providing up to $10,000 in funding.","Summary":"The Micro Voucher Program provides up to $10,000 to help Alberta tech companies design and develop innovative technological solutions.","Grant_Goals":"To support the design and development of innovative technological solutions for Alberta tech companies","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Build a relationship with a strategic partner, validate product to potential customer or market, have first sale or increase sales revenue within 18 months post project, expand supply or distribution channels, increase global competitiveness, provide strategic partner with access to innovative products, help strategic partner to de-risk exposure to new technology, expand products in strategic partners’ distribution channels","Eligible_Applicants":"Alberta small to medium tech enterprises","Eligible_Criteria":"Check Program Guide for full application details","Description":"The Product Demonstration Program provides up to $150,000 to Alberta tech companies seeking to commercialize their products and achieve optimal market position, expand revenue, and enter global markets by partnering with a strategic partner to conduct product pilots or demonstrations.","Summary":"The Product Demonstration Program offers opportunities for Alberta tech companies to partner with a strategic partner, gain financial support, and expand their market reach through product pilots or demonstrations.","Grant_Goals":"To support Alberta tech companies in commercializing products and achieving optimal market position","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":0,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence, Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences","Eligible_Applicants":"Eligible Canadian small and medium-sized enterprises must: be for-profit, be an incorporated legal entity, limited liability partnership (LLP) or cooperative, have an active Canada Revenue Agency business number, employ fewer than 500 full-time equivalent employees, have $100,000 to $100 million in declared revenue in Canada during its past fiscal year (or 12 months for quarterly filers)","Eligible_Criteria":"To apply for CanExport SMEs, consult the Applicant's guide available on the official website.","Description":"CanExport SMEs is a funding program that supports Canadian small and medium-sized enterprises in their international business development efforts. The program provides financial assistance for non-travel activities such as market intelligence gathering, intellectual property protection, certification, expert advice, SEO, marketing materials, and virtual trade show participation.","Summary":"CanExport SMEs provides support for Canadian SMEs to expand globally by funding non-travel activities that contribute to their international market growth.","Grant_Goals":"To help Canadian SMEs grow and succeed in international markets.","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting and Mentoring","Amount":16250,"Deadline":"Closed","Eligible_Region":"Atlantic Provinces","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hire consultants or mentors to help get a new and innovative product, technology, or process to market. Host group learning activities that will improve knowledge and preparedness for commercialization.","Eligible_Applicants":"Small or medium sized business, University or Community College, Research institution (excluding Federal labs)","Eligible_Criteria":"Eligible applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; and/or helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Applicants must not make any financial commitments prior to submission, or costs incurred will not be eligible. Once the application is approved, costs incurred as of the date that the application was received by LearnSphere will be deemed admissible. Please note that meeting the eligibility criteria does not guarantee you will receive funding. Each eligible application will be subject to an evaluation process. A maximum of two projects is allowed per technology. Activities in a second project must demonstrate a progressive, incremental activity, and must not be a continuation of a previous project.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Summary":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Grant_Goals":"Focused on assisting Atlantic Canadian businesses and institutions in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business scale-up and productivity","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery and infrastructure, Assessment, adaptation or adoption of new technologies or new production processes, Activities aimed at boosting productivity and production or innovation capacity, Commercialization and market development, Implementation of commercialization strategies, Participation in trade fairs, Prospecting visits, Hiring of marketing staff, Ad campaigns, Market diagnostics and studies, Technology showcasing and demonstration, Business management, Hiring of resources to set up top-performing teams, Adoption of best management practices, processes and systems","Eligible_Applicants":"SMEs, Co-ops, Business associations, Non-profit organizations, Business support organizations, Indigenous organizations","Eligible_Criteria":"Projects are analyzed against specific criteria, namely: the expected results of your project, the viability of your business or organization, your technical and financial management capacity, the contribution of partners in terms of financial resources or professional services, the degree of risk","Description":"This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program.","Summary":"This funding, which aims to foster innovation and business growth, can be awarded at any stage of a business’s development. Projects submitted by SMEs or NPOs are funded for fostering expansion, productivity and growth through innovation. This funding is provided under the REGI program.","Grant_Goals":"To foster innovation and business growth","Eligible_Industries":["manufacturing","food processing","information, communications and multimedia technologies","life sciences","all"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International marketing, trade events participation","Eligible_Applicants":"Alberta small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations","Eligible_Criteria":"Contact program advisors for application details","Description":"The Alberta Export Expansion Program (AEEP) provides funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Summary":"The AEEP supports Alberta's small- and medium-sized enterprises, industry associations, Indigenous organizations, and economic development organizations in promoting Alberta exports through international travel to formal outbound trade events.","Grant_Goals":"Enhancing international trade and promoting Alberta exports","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of new, innovative technology in natural resources and applied sciences","Eligible_Applicants":"Collaboration between B.C. based industry and academic partner","Eligible_Criteria":"The innovation must have a strong research and commercialization plan, with the aim of achieving commercialization within 3 years of the project start date","Description":"Teams of academia and industry working on projects in the areas of natural resources and applied sciences can receive up to $300,000 for research and development. The project supports the research and development of a new, innovative technology that solves an industry problem in the natural resources, engineering or applied sciences.","Summary":"Teams of academia and industry working on projects in natural resources and applied sciences can receive up to $300,000 for research and development of innovative technologies","Grant_Goals":"To support the research and development of new, innovative technology in natural resources and applied sciences","Eligible_Industries":["technology"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Shipping technology to determine feasibility/compatibility with a partner's technology, Translating, adapting and creating promotional plans or materials, Attending virtual networking functions, meetings or conferences, Travel abroad or in Canada to meet with pre-identified foreign partners, Attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Familiarize yourself with the program details by reading our Applicant’s Guide. 2. Create an account on our online portal. 3. Note: Not compatible with Internet Explorer. 4. Once you are signed in, enter your information under My Profile and select Update. 5. On the CanExport Innovation landing page, select Apply Now!","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides up to $75,000 in funding to support research and development for a single technology, covering up to 75% of associated costs.","Grant_Goals":"To encourage research and development collaborations with international partners","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"error":"No valid text provided for information extraction.","Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises","Deadline":"Closed"},{"Name":"Canada-Alberta Job Grant","Amount":300000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Eligible training activities as outlined in the Canada-Alberta Job Grant.","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations, Metis Settlements, Agriculture Financial Services Corporation, and Alberta Treasury Branches in specific communities.","Eligible_Criteria":"Complete the application process and meet the program requirements.","Description":"The Canada-Alberta Job Grant provides funding to help employers and unemployed Albertans access training opportunities for present and future employees.","Summary":"The grant offers eligible employers up to two-thirds of the cost of eligible training expenses, to a maximum of $10,000 per trainee per fiscal year, or up to $15,000 if hiring and training an unemployed Albertan. Employers are required to contribute at least one-third of the total training costs for existing employees.","Grant_Goals":"To provide funding for training opportunities and skill development for employees in Alberta.","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Writing a business plan, budgeting, marketing campaigns","Eligible_Applicants":"Ontario residents and Canadian citizens, 18 years of age or older","Eligible_Criteria":"Must be able to make a contribution in cash or in kind, at least 25% of the grant amount","Description":"Starter Company Plus provides training, mentoring, and grants of up to $5,000 for starting, expanding, or buying a small business in Ontario.","Summary":"Starter Company Plus offers one-on-one guidance, workshops, mentorship, and grants to support new, expanding, or buying businesses in Ontario.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians, with an additional mandate for small business.","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, Implementation of marketing activities, Project-related management, Professional advisory services after the business is launched, Development of a business plan, marketing plan or feasibilities studies","Eligible_Applicants":"First Nations, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, Native Alliance of Quebec","Eligible_Criteria":"Be a member of a First Nation or the Native Alliance of Quebec, Have the necessary financial resources, Present a viable business project, Have a good credit rating, Have experience and training in the field of activities, Mandatory full-time involvement in the business, Operate a business not involved in the following sectors of activity (gambling, sex, alcohol, tobacco), Other sources of financing","Description":"The Aboriginal Business Financing Program (ABFP) provides non-refundable contributions for start-up, expansion, and marketing activities for businesses owned by First Nations or the Native Alliance of Quebec.","Summary":"The ABFP offers non-refundable contributions of up to $99,999 for eligible First Nations businesses in Quebec to support their start-up, expansion, and marketing activities.","Grant_Goals":"To support the development and growth of businesses owned by First Nations or the Native Alliance of Quebec","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training or professional development for Nunavummiut","Eligible_Applicants":"Registered Nunavut-based employers with a position available for the trainee to advance into after training","Eligible_Criteria":"Contact Career Development for application forms or more information","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment. The Grant covers two-thirds of the eligible costs for each trainee, and funding is subject to availability in the form of a reimbursement to the employer based on the successful completion of training.","Summary":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Grant_Goals":"To encourage employers to provide training or professional development leading to new positions, promotions, increased pay, or regular employment for Nunavummiut","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"First Nations Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business management and marketing skills training","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Submit detailed application with course purpose, outline, and budget; approach other First Nation educational funding agencies; training by approved organizations specific to business management","Description":"Rapid business readiness training program for new and existing First Nations entrepreneurs to develop their management and marketing skills.","Summary":"Supports rapid training for First Nations entrepreneurs to develop management and marketing skills.","Grant_Goals":"To increase the business management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Manitoba First Nation Business Support Program","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Development of quality business plan","Eligible_Applicants":"Manitoba First Nation individuals or First Nation-based enterprises","Eligible_Criteria":"Submit an application describing the business, not have owned a similar business in the past 12 months, provide the name and qualifications of the proposed consultant, proposed terms of reference and a written proposal, including a quote","Description":"Supports Manitoba First Nation individuals or First Nation-based enterprises with a business concept that requires financial assistance and professional business plan development","Summary":"The Manitoba First Nation Business Support Program provides funding of up to $20,000 to support the development of quality business plans for Manitoba First Nation individuals or First Nation-based enterprises","Grant_Goals":"To support the development of quality business plans for Manitoba First Nation individuals or First Nation-based enterprises","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Commercialization of innovative environmental technologies","Eligible_Applicants":"Canadian companies with a strong end-user value proposition and potential to attract a consortia partner","Eligible_Criteria":"The application process is detailed in the How to Apply guide provided. Funding must not surpass 75% of eligible costs, and at least 50% of eligible project costs must be incurred in Canada.","Description":"The SDTC funding aims to support Canadian companies with innovative environmental technologies that demonstrate both environmental and economic benefits. The average contribution is between $2 million and $4 million, with funds disbursed in five years or less.","Summary":"SDTC provides funding support to Canadian companies for the commercialization of innovative environmental technologies, with an average contribution between $2 million and $4 million.","Grant_Goals":"To support the development and commercialization of innovative environmental technologies with demonstrated environmental and economic benefits for Canadians","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation","Amount":0,"Deadline":"Closed","Eligible_Region":"Atlantic Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up, expand, adopt new technologies, improve productivity, create new products, reach new markets, support businesses at each stage of development, build regional networks","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations, co-operatives, Indigenous-owned businesses, non-profit organizations such as post-secondary educational institutions, accelerators, business incubators, angel networks, social enterprises, groups of eligible recipients, municipalities, community-owned Indigenous businesses","Eligible_Criteria":"Contact nearest ACOA office to discuss project and complete and submit the Application for financial assistance.","Description":"The Regional Economic Growth through Innovation program creates conditions to start and grow businesses in Atlantic Canada by offering funding for business scale-up and productivity as well as for regional innovation ecosystems. It supports businesses, non-profit organizations, and under-represented groups to fuel growth and innovation.","Summary":"The REGI program offers funding to businesses and non-profit organizations to support growth, innovation, and productivity in Atlantic Canada.","Grant_Goals":"To create the right conditions to start and grow businesses in Atlantic Canada","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"Yes","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments.","Eligible_Applicants":"For-profit organizations with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue, incorporated or a partnership registered in Alberta, and able to contribute a minimum of 25% cash contribution of the total eligible project costs.","Eligible_Criteria":"To apply, connect with Alberta Innovates through their online application portal or Technology Development Advisor. Applications are reviewed and evaluated to determine fit with the Voucher Program objectives and intended outcomes.","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product development, toward commercialization for novel, promising technologies, and an identified product/market fit.","Summary":"The Voucher Program provides up to $100,000 to help Alberta tech and innovation companies accelerate new product commercialization.","Grant_Goals":"To accelerate new product commercialization for tech and innovation companies in Alberta.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development. Product testing and refinement. Patent development; (excluding patent maintenance fees). Advanced market assessment or segmentation analysis. Certifications. Advanced business and/or marketing strategies. Other technology development activities that will be considered on a case-by-case basis.","Eligible_Applicants":"Small to Medium Enterprise tech companies in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue.","Eligible_Criteria":"Connect with Alberta Innovates to review details and get in touch with next steps.","Description":"The Micro Voucher Program provides up to $10,000 in non-dilutive funding to help Alberta tech companies design and/or develop innovative technological solutions.","Summary":"The program offers funding to help tech companies in Alberta design and/or develop innovative technological solutions.","Grant_Goals":"To help Alberta tech companies design and/or develop innovative technological solutions.","Eligible_Industries":"technology","Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Product pilot or demonstration, partnering with a strategic partner, product commercialization","Eligible_Applicants":"Small to Medium Enterprise tech companies in Alberta","Eligible_Criteria":"Consult the Program Guide for details on eligibility and application process.","Description":"The Product Demonstration Program supports Alberta tech companies to commercialize their products and achieve optimal market position to increase revenue and expand into global markets.","Summary":"Provides up to $150,000 for Alberta tech companies to conduct product pilots or demonstrations with strategic partners.","Grant_Goals":"To support Alberta tech companies in commercializing products, increasing revenue, and expanding into global markets.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"}]