[{"Name":"Mitacs Accelerate","Amount":7500,"Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Collaborating with faculty, college students, graduate students, and postdoctoral fellows on complex research challenges","Eligible_Applicants":"For-profit corporations, not-for-profit corporations, municipalities, hospitals, and full-time graduate students in select Mitacs partner countries","Eligible_Criteria":"Visit Mitacs website for detailed eligibility and application instructions","Description":"Mitacs Accelerate program offers funding for collaborative research projects between industry and academia, providing opportunities for corporations and students to work together on research challenges","Summary":"Mitacs Accelerate program provides funding for collaborative research projects between industry and academia, supporting projects that involve college students, graduate students, and postdoctoral fellows","Grant_Goals":"To facilitate collaborative research and innovation between industry and academic institutions","Eligible_Industries":["all"],"Link":"https://www.mitacs.ca/en/programs/accelerate#business?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"NRC IRAP Technology Innovation Grant","Amount":10000000,"Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development projects at various stages of the innovation cycle","Eligible_Applicants":"Incorporated, profit-oriented small or medium-sized businesses in Canada with 500 or fewer full-time equivalent employees pursuing growth and profit by developing and commercializing innovative, technology-driven new or improved products, services or processes in Canada","Eligible_Criteria":"Contact NRC IRAP at 1-877-994-4727 to determine eligibility and submit preliminary due diligence materials including a business plan, company financials, and management team resumes","Description":"NRC IRAP provides funding to eligible firms under technology innovation projects and youth employment strategy programs. It offers increased funding support of up to $10 million for larger research and development projects to facilitate growth and expansion of Canadian businesses.","Summary":"NRC IRAP provides financial support for technology-driven innovation to small and medium‑sized Canadian businesses to facilitate growth, development, and expansion.","Grant_Goals":"To help recipients achieve transformative growth within 5 years of completing their research and development projects and significantly benefit Canada's economy","Eligible_Industries":["all"],"Link":"https://nrc.canada.ca/en/support-technology-innovation/financial-support-technology-innovation-through-nrc-irap?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Innovative Solutions Canada","Amount":"Coming Soon","Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Developing novel solutions to challenges, early development, testing and validation of prototypes, commercialization pathway.","Eligible_Applicants":"Eligible Canadian small businesses and innovators","Eligible_Criteria":"Details about the program and how to apply can be found on the Innovative Solutions Canada website.","Description":"The Government of Canada is looking for innovators to solve challenges and is partnering with eligible Canadian small businesses to support growth and development.","Summary":"The program offers funding to develop proof of feasibility, prototypes, and may lead to the first buyer being the Government of Canada.","Grant_Goals":"To support the growth of Canadian innovators and entrepreneurs by solving challenges.","Eligible_Industries":["all"],"Link":"https://ised-isde.canada.ca/site/innovative-solutions-canada/en/challenges"},{"Name":"Grand Challenges Canada","Amount":"Coming Soon","Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"To be determined by open funding opportunities","Eligible_Applicants":"Best and brightest innovators in low- and middle-income countries and Canada","Eligible_Criteria":"To be determined by open funding opportunities","Description":"Grand Challenges Canada seeks bold ideas from innovators to save and improve lives in low- and middle-income countries and Canada.","Summary":"Grand Challenges Canada funds innovative ideas to generate transformative impact on global health.","Grant_Goals":"To save and improve lives in low- and middle-income countries and Canada","Eligible_Industries":["healthcare","all"],"Link":"https://www.grandchallenges.ca/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"SDTC Funding","Amount":"Coming Soon","Deadline":"Continuous","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Business expansion, new product line development, environmental and economic benefit demonstration","Eligible_Applicants":"Canadian companies with defined projects, strong end-user value proposition, potential to attract a consortia partner, demonstrated environmental and economic benefits for Canadians","Eligible_Criteria":"Please refer to SDTC website for application process.","Description":"Sustainable Development Technology Canada (SDTC) provides funding for Canadian companies with innovative projects that demonstrate environmental and economic benefits for Canadians.","Summary":"SDTC provides up to 40% of eligible project costs, with funds disbursed in five years or less. Private sector contributions of at least 25% are required. Eligible projects must incur at least 50% of costs in Canada.","Grant_Goals":"To establish a growing pipeline of emerging companies that will become the next market leaders in sustainability.","Eligible_Industries":["all"],"Link":"https://www.sdtc.ca/en/start-up-and-scale-up/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Regional Economic Growth through Innovation (REGI) program","Amount":"Coming Soon","Deadline":"Continuous","Eligible_Region":"Atlantic Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"scale up and expand, make the most of new technologies, improve productivity, create new products, find new markets, support businesses at each stage of development, strengthen business support networks for under-represented groups","Eligible_Applicants":"sole proprietorships, partnerships, social enterprises, incorporated companies, corporations, co-operatives, Indigenous-owned businesses, all other types of enterprises, non-profit organizations such as post-secondary educational institutions, accelerators, business incubators, angel networks, a group of eligible recipients such as an industry association, consortium, a municipality, other municipal-type organizations, community-owned Indigenous businesses","Eligible_Criteria":"Contact the nearest ACOA office to discuss the project and complete/submit the Application for financial assistance.","Description":"The Regional Economic Growth through Innovation (REGI) program aims to create the right conditions to start and grow businesses in Atlantic Canada. It offers two funding options: Business Scale-up and Productivity, and Regional Innovation Ecosystems.","Summary":"The REGI program provides unsecured and interest-free repayment contributions to help businesses in Atlantic Canada speed up their growth and support non-profit organizations that foster growth and innovation in the region.","Grant_Goals":"Creating the conditions to facilitate the start and growth of businesses in Atlantic Canada.","Eligible_Industries":["all"],"Link":"https://www.canada.ca/en/atlantic-canada-opportunities/services/regional-economic-growth-through-innovation.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Voucher Program","Amount":100000,"Deadline":"Continuous","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"New product research and development, Leading-edge design, engineering and prototype development, Advanced product testing and refinement, Patent development, Advanced market assessments","Eligible_Applicants":"For profit organization that is incorporated, or a partnership registered in Alberta with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue. Can contribute a minimum of 25 per cent cash contribution of the total eligible project costs. Have a new, unique technology or innovation that is patentable working toward commercialization.","Eligible_Criteria":"Connect With Us! Review details. Submit application forms through SmartSimple, or connect with your Technology Development Advisor with any questions.","Description":"The Voucher Program provides Alberta tech and innovation companies with up to $100,000 to accelerate new product toward commercialization for novel, promising technologies, and an identified product/market fit. Can help cover the costs of up to three contracted service providers for business and technology development related activities.","Summary":"The Voucher Program provides Alberta tech companies with up to $100,000 to accelerate new product commercialization.","Grant_Goals":"To accelerate new product commercialization for tech and innovation companies in Alberta","Eligible_Industries":["technology","all"],"Link":"https://albertainnovates.ca/programs/voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Micro Voucher Program","Amount":10000,"Deadline":"Continuous","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Design, engineering, and prototype development, product testing and refinement, patent development, advanced market assessment, certifications, advanced business and marketing strategies, other technology development activities","Eligible_Applicants":"Small to Medium Enterprise with fewer than 500 full-time employees and less than $50,000,000 in annual gross revenue","Eligible_Criteria":"Check the complete list of eligibility requirements in the Program Guide","Description":"The Micro Voucher Program provides up to $10,000 in non-dilutive funding to help Alberta tech companies design and/or develop innovative technology solutions.","Summary":"The Micro Voucher Program provides non-dilutive funding of up to $10,000 to support technology development for eligible Alberta tech companies.","Grant_Goals":"To support the design and development of innovative technological solutions for Alberta tech companies.","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/micro-voucher/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Product Demonstration Program","Amount":150000,"Deadline":"Continuous","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":50000000,"Eligible_Employees":2,"Eligible_Activities":"Enter a partnership with a strategic partner to conduct a product pilot or demonstration that proves the product’s technical and business merits","Eligible_Applicants":"Alberta tech companies may be eligible to enter a partnership with a strategic partner to conduct a product pilot or demonstration","Eligible_Criteria":"Complete the pilot or demonstration within one year and expect a first sale or distribution agreement within 18 months if the pilot is successful","Description":"The Product Demonstration Program supports Alberta tech companies commercialize their products and achieve optimal market position to increase revenue and expand into global markets.","Summary":"The Product Demonstration Program provides up to $150,000 to Alberta tech companies for product pilot or demonstration to achieve optimal market position and increase revenue.","Grant_Goals":"To support Alberta tech companies in commercializing their products and achieving optimal market position","Eligible_Industries":["technology"],"Link":"https://albertainnovates.ca/programs/product-demonstration-program/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport SMEs","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"Yes","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Gathering market intelligence (custom research, reports and studies), Applying for intellectual property protection in international markets, Applying for certification in international markets, Seeking expert legal and business advice, Search Engine Optimization, Translating, adapting or creating marketing materials, Attending virtual trade shows, networking functions, meetings or conferences","Eligible_Applicants":"Eligible Canadian small and medium-sized enterprises must: be for-profit, be an incorporated legal entity, limited liability partnership (LLP) or cooperative, have an active Canada Revenue Agency business number, employ fewer than 500 full-time equivalent employees, have $100,000 to $100 million in declared revenue in Canada during its past fiscal year (or 12 months for quarterly filers)","Eligible_Criteria":"Coming Soon","Description":"CanExport SMEs was a program that supported Canadian small and medium-sized enterprises in their efforts to develop new export opportunities and markets, especially high-growth emerging markets. The program also facilitated the process of expanding their export capacity and reaching new challenging markets. The focus was on non-travel activities that would enable SMEs to mobilize their efforts internationally.","Summary":"CanExport SMEs was designed to provide financial support to help SMEs with identifying and developing export opportunities in international markets, increasing their global reach, and efficiently competing in the global market. The program aimed to support companies in reaching international markets through non-travel activities and facilitate their export growth.","Grant_Goals":"To help Canadian small and medium-sized enterprises develop new export markets and increase their export capacity","Eligible_Industries":["all"],"Link":"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Commercialization Consulting and Mentoring Program","Amount":16250,"Deadline":"Closed","Eligible_Region":"Atlantic Provinces","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Hire consultants or mentors, host group learning activities","Eligible_Applicants":"Small or medium-sized business, University, Community College, Research institution","Eligible_Criteria":"Eligible applicants must demonstrate that the proposed activity supports the commercialization of a new and innovative product, technology, or process; helps develop and maintain partnerships, technology transfers, and/or licensing agreements. Costs incurred as of the date that the application was received by LearnSphere will be deemed admissible.","Description":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to help Atlantic Canadian businesses and institutions in the final stages of commercialization.","Summary":"The Commercialization Consulting and Mentoring Program (CCM) provides financial assistance to support the commercialization of new and innovative products, technologies, or processes.","Grant_Goals":"To assist Atlantic Canadian businesses and institutions in the final stages of commercialization","Eligible_Industries":["all"],"Link":"https://learnsphere.ca/commercialization/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Business Innovation and Growth Funding","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Acquisition of digital production equipment or machinery, assessment or adoption of new technologies or production processes, boosting productivity and innovation capacity, market development, technology demonstration","Eligible_Applicants":"SMEs, NPOs, co-ops, business associations, business support organizations, indigenous organizations","Eligible_Criteria":"Projects are analyzed based on expected results, viability of the business or organization, technical and financial management capacity, contribution of partners, and degree of risk","Description":"This funding aims to foster innovation and business growth, providing financial assistance to SMEs and NPOs for projects fostering expansion, productivity, and growth through innovation. Repayment terms vary for SMEs and NPOs.","Summary":"The funding supports projects aimed at fostering expansion, productivity, and growth through innovation in eligible sectors such as manufacturing, food processing, information technology, life sciences, and other potentially eligible sectors.","Grant_Goals":"To foster innovation and business growth in eligible sectors, leading to increased productivity and expansion","Eligible_Industries":["manufacturing","food processing","technology","healthcare","all"],"Link":"https://ced.canada.ca/en/funding/business-scale-up-and-productivity/?_ga=2.164727798.892461753.1667851909-1211495354.1644949959&_gl=1*10395ai*_ga*MTIxMTQ5NTM1NC4xNjQ0OTQ5OTU5*_ga_Q2F69KPVZ5*MTY2Nzk1NDI4MS42LjEuMTY2Nzk1NDM5Ny4wLjAuMA..&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Alberta Export Expansion Program","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"International travel to formal outbound trade events","Eligible_Applicants":"Alberta companies and non-profits","Eligible_Criteria":"Coming Soon","Description":"Funding to help export-ready companies and non-profit organizations enhance access to international markets and attract global buyers.","Summary":"Supports Alberta’s small- and medium-sized enterprises, industry associations, Indigenous organizations, economic development organizations that promote Alberta exports through international travel to formal outbound trade events.","Grant_Goals":"Enhancing international trade","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/alberta-export-expansion-program.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Ignite","Amount":300000,"Deadline":"Closed","Eligible_Region":"British Columbia","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of new, innovative technology in natural resources, engineering, or applied sciences","Eligible_Applicants":"Teams of academia and industry working on projects in the areas of natural resources and applied sciences in British Columbia","Eligible_Criteria":"The project must meet specific criteria related to the innovation level, market potential, research, commercialization plan, and securing matching funds.","Description":"The Ignite program supports the research and development of new, innovative technology that solves industry problems in natural resources, engineering, or applied sciences. It provides funding for teams of academia and industry working on collaborative projects in British Columbia.","Summary":"The Ignite program provides funding of up to $300,000 to support collaborative projects between academia and industry in British Columbia for the research and development of innovative technology in natural resources, engineering, or applied sciences.","Grant_Goals":"To support the research and development of innovative technology that solves industry problems in natural resources, engineering, or applied sciences.","Eligible_Industries":["natural resources","engineering","applied sciences"],"Link":"https://innovatebc.ca/what-we-offer/get-funding/ignite/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"CanExport Innovation","Amount":75000,"Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Applying for intellectual property protection in international markets, applying for certification in international markets, seeking expert legal and business advice, shipping technology to determine feasibility/compatibility with a partner's technology, translating, adapting and creating promotional plans or materials, attending virtual networking functions, meetings or conferences, travel abroad or in Canada to meet with pre-identified foreign partners, attending an event or conference to meet with pre-identified foreign partners","Eligible_Applicants":"Canadian small and medium-sized enterprises, Canadian academic institutions, Canadian non-government research centres","Eligible_Criteria":"Follow these steps to apply for CanExport Innovation: 1. Familiarize yourself with the program details by reading our Applicant’s Guide. 2. Create an account on our online portal. 3. Note: Not compatible with Internet Explorer. 4. Once you are signed in, enter your information under My Profile and select Update. 5. On the CanExport Innovation landing page, select Apply Now!","Description":"Innovators from Canadian organizations may access up to $75,000 in funding to assist with research and development (R&D) for a single technology. We cover up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Summary":"CanExport Innovation provides funding of up to $75,000 to support research and development (R&D) for a single technology. It covers up to 75% of costs to pursue and sign collaborative R&D agreements with international partners.","Grant_Goals":"To increase the capability and capacity for Canadian organizations to collaborate on research and development (R&D) with international partners.","Eligible_Industries":["technology"],"Link":"https://www.tradecommissioner.gc.ca/tcs-sdc/funding-financement/canexport/innovation/index.aspx?lang=eng&utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"IDEaS","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"IDEaS provides funding mechanisms to assist Canadian innovators in solving defence and security challenges, including phased development, innovation networks, contests, sandboxes, and test drives.","Eligible_Applicants":"Canadian innovators working on defence and security challenges","Eligible_Criteria":"Join the mailing list to receive emails for new Calls for Proposals and ongoing updates.","Description":"Innovation for Defence Excellence and Security (IDEaS) is an initiative that accelerates concepts and propels solutions forward, building a defence innovation ecosystem. It provides funding mechanisms such as competitive projects, innovation networks, contests, sandboxes, and test drives to assist Canadian innovators in solving defence and security challenges.","Summary":"IDEaS provides funding opportunities and support for Canadian innovators working on defence and security challenges, aiming to propel technology forward and stimulate the free flow of innovative ideas critical for innovations.","Grant_Goals":"To accelerate concepts and propel solutions forward, building a defence innovation ecosystem.","Eligible_Industries":["defence","security","innovation","technology"],"Link":"https://www.canada.ca/en/department-national-defence/programs/defence-ideas.html?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Canada-Alberta Job Grant","Amount":300000,"Deadline":"Closed","Eligible_Region":"Alberta","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training costs for existing employees","Eligible_Applicants":"Private sector employers, non-profit sector employers, First Nations and Metis Settlements, the Agriculture Financial Services Corporation, Alberta Treasury Branches","Eligible_Criteria":"Applications must be submitted through the online portal. Check the Applicant Guide every time you apply to make sure you are up to date on the program requirements.","Description":"The Canada-Alberta Job Grant is a training program where an employer applies on behalf of their present or future employees for eligible training costs.","Summary":"Funding provided by the Government of Canada through the Workforce Development Agreement. Employers decide who gets training and what type of training may be needed for their employees.","Grant_Goals":"Training program to help employees and unemployed Albertans access training opportunities","Eligible_Industries":["all"],"Link":"https://www.alberta.ca/canada-alberta-job-grant.aspx?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Starter Company Plus","Amount":5000,"Deadline":"Closed","Eligible_Region":"Ontario","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"participate in business workshops, seminars or networking events","Eligible_Applicants":"an Ontario resident and Canadian citizen (or permanent resident)","Eligible_Criteria":"You can apply through a Small Business Enterprise Centre.","Description":"If you’re starting, expanding or buying a small business, apply for training, mentoring and a grant through our Starter Company Plus program.","Summary":"If you’re starting, expanding or buying a small business in Ontario, you can get guidance, participate in workshops, and apply for a grant of up to $5,000 through the Starter Company Plus program.","Grant_Goals":"Supporting a strong, innovative economy that can provide jobs and prosperity for all Ontarians, with an additional mandate for small business.","Eligible_Industries":["all"],"Link":"https://www.ontario.ca/page/starter-company-plus?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Aboriginal Business Financing Program (ABFP)","Amount":99999,"Deadline":"Closed","Eligible_Region":"Quebec","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Start-up, acquisition or expansion of a business, Implementation of marketing activities, Project-related management, Professional advisory services after the business is launched (accountant or other), Development of a business plan, marketing plan or feasibilities studies","Eligible_Applicants":"FIRST NATIONS, Abenaki, Algonquin, Atikamekw, Cree, Huron-Wendat, Malecite, Micmac, NATIVE ALLIANCE OF QUEBEC","Eligible_Criteria":"Be a First Nation or the Native Alliance of Quebec, Have the necessary financial resources, Present a viable business project, Have a good credit rating, Have experience and training in the field of activities, Mandatory full-time involvement in the business, Operate a business not involved in gambling, sex, alcohol, tobacco","Description":"The Aboriginal Business Financing Program (ABFP) provides non-refundable contributions for start-up, acquisition or expansion of a business, marketing activities, project-related management, professional advisory services, and development of business plans and feasibilities studies for First Nations and alliances in Quebec.","Summary":"The Aboriginal Business Financing Program (ABFP) offers non-refundable contributions of up to $99,999 for eligible projects in the First Nations business community in Quebec.","Grant_Goals":"To support the development and growth of businesses within the First Nations community in Quebec","Eligible_Industries":["all"],"Link":"https://socca.qc.ca/en/non-refundable-contribution/?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Grant for Nunavut Employers","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Nunavut","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Training or professional development for Nunavummiut leading to a new position, promotion, increased pay, or regular employment","Eligible_Applicants":"Registered Nunavut-based employers with open positions for trainees to advance into after training","Eligible_Criteria":"Contact CareerDevelopment-TLMP@gov.nu.ca for application forms or more information","Description":"The Grant for Nunavut Employers encourages employers to provide training or professional development to Nunavummiut, leading to a new position, a promotion, increased pay within the organization, or regular employment.","Summary":"The Grant for Nunavut Employers covers two-thirds of eligible training costs for each trainee, subject to availability and successful completion of training.","Grant_Goals":"To encourage employers to provide training and professional development for Nunavummiut leading to improved employment opportunities","Eligible_Industries":["all"],"Link":"https://www.gov.nu.ca/en/department-family-services/grant-nunavut-employers?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"First Nations Rapid Business Readiness Training","Amount":"Coming Soon","Deadline":"Closed","Eligible_Region":"Canada","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Rapid business readiness training, management and marketing skills development","Eligible_Applicants":"First Nations entrepreneurs","Eligible_Criteria":"Submission of application with course purpose, outline and budget. Approach other First Nation educational funding agencies. Training through approved trainers/organizations. Business management specific training.","Description":"The program supports rapid business readiness training for new and existing First Nations entrepreneurs to develop their management and marketing skills. Funding covers up to 75% of approved course costs and is intended for direct course expenses only, excluding living expenses and academic degrees or certificates.","Summary":"The First Nations Rapid Business Readiness Training program provides funding support for new and existing First Nations entrepreneurs to develop management and marketing skills through rapid business readiness training.","Grant_Goals":"To enhance the management and marketing skills of First Nations entrepreneurs","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/skills_development.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"},{"Name":"Manitoba First Nation Business Support Program","Amount":20000,"Deadline":"Closed","Eligible_Region":"Manitoba","Eligible_Profitable":"No","Eligible_Revenue":100000,"Eligible_Employees":2,"Eligible_Activities":"Research and development of a business plan","Eligible_Applicants":"Members of Manitoba First Nation, aged 18 and over, eligible to work in Canada","Eligible_Criteria":"Approval of funding is required prior to consultant commencing the assignment","Description":"The program provides support to Manitoba First Nation individuals or First Nation-based enterprises with a business concept that demonstrates a need for financial assistance.","Summary":"The program allows applicants to engage the services of a professional consultant to develop a quality business plan.","Grant_Goals":"To support the development of quality business plans for Manitoba First Nation individuals or enterprises","Eligible_Industries":["all"],"Link":"https://www.firstpeoplesfund.ca/business_plan.php?utm_source=bbf-orae&utm_medium=website&utm_campaign=FTF&utm_term=business_benefits_finder-outil_recherche_aide_aux_entreprises"}]